# CCNA –ú–∏–Ω–∏-–∫—É—Ä—Å –Ω–∞ –æ—Å–Ω–æ–≤–µ Jeremy's Mega Lab
## –ß–∞—Å—Ç—å 2: VLANs & Layer-2 EtherChannel

---

## üìã –¢–µ–æ—Ä–µ—Ç–∏—á–µ—Å–∫–∏–π –º–∏–Ω–∏–º—É–º

### –ö–ª—é—á–µ–≤—ã–µ –∫–æ–Ω—Ü–µ–ø—Ü–∏–∏:

**1. VLAN** - –ª–æ–≥–∏—á–µ—Å–∫–æ–µ —Ä–∞–∑–¥–µ–ª–µ–Ω–∏–µ –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä–∞ –Ω–∞ –∏–∑–æ–ª–∏—Ä–æ–≤–∞–Ω–Ω—ã–µ —Å–µ–≥–º–µ–Ω—Ç—ã
**2. Trunk** - –∫–∞–Ω–∞–ª, –ø–µ—Ä–µ–¥–∞—é—â–∏–π —Ç—Ä–∞—Ñ–∏–∫ –Ω–µ—Å–∫–æ–ª—å–∫–∏—Ö VLAN (802.1Q —Ç–µ–≥–∏—Ä–æ–≤–∞–Ω–∏–µ)
**3. Access Port** - –ø–æ—Ä—Ç –¥–ª—è –∫–æ–Ω–µ—á–Ω—ã—Ö —É—Å—Ç—Ä–æ–π—Å—Ç–≤ (–æ–¥–∏–Ω VLAN)
**4. EtherChannel** - –∞–≥—Ä–µ–≥–∞—Ü–∏—è –∫–∞–Ω–∞–ª–æ–≤ (PAgP - Cisco, LACP - —Å—Ç–∞–Ω–¥–∞—Ä—Ç)
**5. VTP** - —Å–∏–Ω—Ö—Ä–æ–Ω–∏–∑–∞—Ü–∏—è VLAN –º–µ–∂–¥—É –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä–∞–º–∏

---

## üéØ –¶–µ–ª–∏ —Ä–∞–∑–¥–µ–ª–∞

- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å Layer-2 EtherChannel (PAgP –∏ LACP)
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å trunk –ø–æ—Ä—Ç—ã —Å –ø—Ä–∞–≤–∏–ª—å–Ω—ã–º–∏ –ø–∞—Ä–∞–º–µ—Ç—Ä–∞–º–∏
- ‚úÖ –°–æ–∑–¥–∞—Ç—å –∏ –Ω–∞–∑–Ω–∞—á–∏—Ç—å VLANs
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å VTP –¥–ª—è —Å–∏–Ω—Ö—Ä–æ–Ω–∏–∑–∞—Ü–∏–∏ VLAN
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å access –ø–æ—Ä—Ç—ã –¥–ª—è –∫–æ–Ω–µ—á–Ω—ã—Ö —É—Å—Ç—Ä–æ–π—Å—Ç–≤
- ‚úÖ –û—Ç–∫–ª—é—á–∏—Ç—å –Ω–µ–∏—Å–ø–æ–ª—å–∑—É–µ–º—ã–µ –ø–æ—Ä—Ç—ã

---

## üó∫Ô∏è –°—Ç—Ä—É–∫—Ç—É—Ä–∞ VLANs

### Office A:
- **VLAN 10** - PCs (10.1.0.0/24)
- **VLAN 20** - Phones (10.2.0.0/24)
- **VLAN 40** - Wi-Fi (10.6.0.0/24)
- **VLAN 99** - Management (10.0.0.0/28)

### Office B:
- **VLAN 10** - PCs (10.3.0.0/24)
- **VLAN 20** - Phones (10.4.0.0/24)
- **VLAN 30** - Servers (10.5.0.0/24)
- **VLAN 99** - Management (10.0.0.16/28)

---

## üìù –ß–ê–°–¢–¨ 1: EtherChannel Configuration

### –®–ê–ì 1: PAgP EtherChannel (Office A)

**DSW-A1 ‚Üî DSW-A2 —á–µ—Ä–µ–∑ G1/0/4-5**

```cisco
! –ù–∞ DSW-A1
DSW-A1(config)# interface range g1/0/4-5
DSW-A1(config-if-range)# channel-group 1 mode desirable
DSW-A1(config-if-range)# exit

! –ù–∞ DSW-A2
DSW-A2(config)# interface range g1/0/4-5
DSW-A2(config-if-range)# channel-group 1 mode desirable
DSW-A2(config-if-range)# exit
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
DSW-A2# show etherchannel summary
```
–û–∂–∏–¥–∞–µ—Ç—Å—è: `Po1(SU)` –∏ —Ñ–ª–∞–≥ `P` –Ω–∞ –ø–æ—Ä—Ç–∞—Ö

---

### –®–ê–ì 2: LACP EtherChannel (Office B)

**DSW-B1 ‚Üî DSW-B2 —á–µ—Ä–µ–∑ G1/0/4-5**

```cisco
! –ù–∞ DSW-B1
DSW-B1(config)# interface range g1/0/4-5
DSW-B1(config-if-range)# channel-group 1 mode active
DSW-B1(config-if-range)# exit

! –ù–∞ DSW-B2
DSW-B2(config)# interface range g1/0/4-5
DSW-B2(config-if-range)# channel-group 1 mode active
DSW-B2(config-if-range)# exit
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
DSW-B2# show etherchannel summary
```

üí° **PAgP vs LACP:**
- PAgP: —Ä–µ–∂–∏–º—ã `desirable` (–∞–∫—Ç–∏–≤–Ω—ã–π) / `auto` (–ø–∞—Å—Å–∏–≤–Ω—ã–π) - Cisco proprietary
- LACP: —Ä–µ–∂–∏–º—ã `active` (–∞–∫—Ç–∏–≤–Ω—ã–π) / `passive` (–ø–∞—Å—Å–∏–≤–Ω—ã–π) - IEEE —Å—Ç–∞–Ω–¥–∞—Ä—Ç

---

## üìù –ß–ê–°–¢–¨ 2: Trunk Configuration

### –®–ê–ì 3: –ù–∞—Å—Ç—Ä–æ–π–∫–∞ Trunk –ø–æ—Ä—Ç–æ–≤

**–ü–∞—Ä–∞–º–µ—Ç—Ä—ã –¥–ª—è –≤—Å–µ—Ö trunk:**
- Mode: trunk
- DTP: –æ—Ç–∫–ª—é—á–µ–Ω (`switchport nonegotiate`)
- Native VLAN: 1000 (–±–µ–∑–æ–ø–∞—Å–Ω–æ—Å—Ç—å)
- Allowed VLANs: Office A (10,20,40,99), Office B (10,20,30,99)

---

### Office A: DSW-A1

```cisco
! Trunk –∫ Access switches
DSW-A1(config)# interface range g1/0/1-3
DSW-A1(config-if-range)# switchport mode trunk
DSW-A1(config-if-range)# switchport nonegotiate
DSW-A1(config-if-range)# switchport trunk native vlan 1000
DSW-A1(config-if-range)# switchport trunk allowed vlan 10,20,40,99
DSW-A1(config-if-range)# exit

! Trunk –Ω–∞ PortChannel
DSW-A1(config)# interface port-channel 1
DSW-A1(config-if)# switchport mode trunk
DSW-A1(config-if)# switchport nonegotiate
DSW-A1(config-if)# switchport trunk native vlan 1000
DSW-A1(config-if)# switchport trunk allowed vlan 10,20,40,99
DSW-A1(config-if)# exit
```

---

### Office A: DSW-A2

```cisco
DSW-A2(config)# interface range g1/0/1-3
DSW-A2(config-if-range)# switchport mode trunk
DSW-A2(config-if-range)# switchport nonegotiate
DSW-A2(config-if-range)# switchport trunk native vlan 1000
DSW-A2(config-if-range)# switchport trunk allowed vlan 10,20,40,99
DSW-A2(config-if-range)# exit

DSW-A2(config)# interface port-channel 1
DSW-A2(config-if)# switchport mode trunk
DSW-A2(config-if)# switchport nonegotiate
DSW-A2(config-if)# switchport trunk native vlan 1000
DSW-A2(config-if)# switchport trunk allowed vlan 10,20,40,99
DSW-A2(config-if)# exit
```

---

### Office A: Access Switches (ASW-A1, A2, A3)

```cisco
! –û–¥–∏–Ω–∞–∫–æ–≤—ã–µ –∫–æ–º–∞–Ω–¥—ã –¥–ª—è –≤—Å–µ—Ö —Ç—Ä—ë—Ö
ASW-A1(config)# interface range g0/1-2
ASW-A1(config-if-range)# switchport mode trunk
ASW-A1(config-if-range)# switchport nonegotiate
ASW-A1(config-if-range)# switchport trunk native vlan 1000
ASW-A1(config-if-range)# switchport trunk allowed vlan 10,20,40,99
ASW-A1(config-if-range)# exit
```

–ü–æ–≤—Ç–æ—Ä–∏—Ç–µ –Ω–∞ **ASW-A2** –∏ **ASW-A3**

---

### Office B: DSW-B1

```cisco
DSW-B1(config)# interface range g1/0/1-3
DSW-B1(config-if-range)# switchport mode trunk
DSW-B1(config-if-range)# switchport nonegotiate
DSW-B1(config-if-range)# switchport trunk native vlan 1000
DSW-B1(config-if-range)# switchport trunk allowed vlan 10,20,30,99
DSW-B1(config-if-range)# exit

DSW-B1(config)# interface port-channel 1
DSW-B1(config-if)# switchport mode trunk
DSW-B1(config-if)# switchport nonegotiate
DSW-B1(config-if)# switchport trunk native vlan 1000
DSW-B1(config-if)# switchport trunk allowed vlan 10,20,30,99
DSW-B1(config-if)# exit
```

---

### Office B: DSW-B2

```cisco
DSW-B2(config)# interface range g1/0/1-3
DSW-B2(config-if-range)# switchport mode trunk
DSW-B2(config-if-range)# switchport nonegotiate
DSW-B2(config-if-range)# switchport trunk native vlan 1000
DSW-B2(config-if-range)# switchport trunk allowed vlan 10,20,30,99
DSW-B2(config-if-range)# exit

DSW-B2(config)# interface port-channel 1
DSW-B2(config-if)# switchport mode trunk
DSW-B2(config-if)# switchport nonegotiate
DSW-B2(config-if)# switchport trunk native vlan 1000
DSW-B2(config-if)# switchport trunk allowed vlan 10,20,30,99
DSW-B2(config-if)# exit
```

---

### Office B: Access Switches (ASW-B1, B2, B3)

```cisco
! –û–¥–∏–Ω–∞–∫–æ–≤—ã–µ –∫–æ–º–∞–Ω–¥—ã –¥–ª—è –≤—Å–µ—Ö —Ç—Ä—ë—Ö
ASW-B1(config)# interface range g0/1-2
ASW-B1(config-if-range)# switchport mode trunk
ASW-B1(config-if-range)# switchport nonegotiate
ASW-B1(config-if-range)# switchport trunk native vlan 1000
ASW-B1(config-if-range)# switchport trunk allowed vlan 10,20,30,99
ASW-B1(config-if-range)# exit
```

–ü–æ–≤—Ç–æ—Ä–∏—Ç–µ –Ω–∞ **ASW-B2** –∏ **ASW-B3**

---

## üìù –ß–ê–°–¢–¨ 3: VTP Configuration

### –®–ê–ì 4: –ù–∞—Å—Ç—Ä–æ–π–∫–∞ VTP

**–ö–æ–Ω—Ü–µ–ø—Ü–∏—è:**
- VTP Domain: `JeremysITLab`
- VTP Version: 2
- DSW = Server, ASW = Client

---

### Office A: VTP Setup

```cisco
! DSW-A1 (Server)
DSW-A1(config)# vtp domain JeremysITLab
DSW-A1(config)# vtp version 2
DSW-A1(config)# exit

! ASW-A1 (Client)
ASW-A1(config)# vtp mode client
ASW-A1(config)# exit

! ASW-A2 (Client)
ASW-A2(config)# vtp mode client
ASW-A2(config)# exit

! ASW-A3 (Client)
ASW-A3(config)# vtp mode client
ASW-A3(config)# exit
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
ASW-A3# show vtp status
```

---

### Office B: VTP Setup

```cisco
! DSW-B1 (Server)
DSW-B1(config)# vtp domain JeremysITLab
DSW-B1(config)# vtp version 2
DSW-B1(config)# exit

! ASW-B1 (Client)
ASW-B1(config)# vtp mode client

! ASW-B2 (Client)
ASW-B2(config)# vtp mode client

! ASW-B3 (Client)
ASW-B3(config)# vtp mode client
```

---

## üìù –ß–ê–°–¢–¨ 4: VLAN Creation

### –®–ê–ì 5: –°–æ–∑–¥–∞–Ω–∏–µ VLANs Office A

**–ù–∞ DSW-A1 (VTP —Ä–∞—Å–ø—Ä–æ—Å—Ç—Ä–∞–Ω–∏—Ç –Ω–∞ –æ—Å—Ç–∞–ª—å–Ω—ã–µ):**

```cisco
DSW-A1(config)# vlan 10
DSW-A1(config-vlan)# name PCs
DSW-A1(config-vlan)# exit

DSW-A1(config)# vlan 20
DSW-A1(config-vlan)# name Phones
DSW-A1(config-vlan)# exit

DSW-A1(config)# vlan 40
DSW-A1(config-vlan)# name Wi-Fi
DSW-A1(config-vlan)# exit

DSW-A1(config)# vlan 99
DSW-A1(config-vlan)# name Management
DSW-A1(config-vlan)# exit
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
DSW-A1# show vlan brief
ASW-A3# show vlan brief
```

---

### –®–ê–ì 6: –°–æ–∑–¥–∞–Ω–∏–µ VLANs Office B

**–ù–∞ DSW-B1:**

```cisco
DSW-B1(config)# vlan 10
DSW-B1(config-vlan)# name PCs
DSW-B1(config-vlan)# exit

DSW-B1(config)# vlan 20
DSW-B1(config-vlan)# name Phones
DSW-B1(config-vlan)# exit

DSW-B1(config)# vlan 30
DSW-B1(config-vlan)# name Servers
DSW-B1(config-vlan)# exit

DSW-B1(config)# vlan 99
DSW-B1(config-vlan)# name Management
DSW-B1(config-vlan)# exit
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
ASW-B3# show vlan brief
```

---

## üìù –ß–ê–°–¢–¨ 5: Access Port Configuration

### –®–ê–ì 7: –ù–∞—Å—Ç—Ä–æ–π–∫–∞ Access –ø–æ—Ä—Ç–æ–≤

**–¢–∏–ø—ã –ø–æ–¥–∫–ª—é—á–µ–Ω–∏–π:**
- LWAP (ASW-A1, B1): VLAN 99
- PC + Phone (ASW-A2, A3, B2): VLAN 10 + Voice VLAN 20
- Server (ASW-B3): VLAN 30

---

### ASW-A1: LWAP –ø–æ–¥–∫–ª—é—á–µ–Ω–∏–µ

```cisco
ASW-A1(config)# interface f0/1
ASW-A1(config-if)# switchport mode access
ASW-A1(config-if)# switchport nonegotiate
ASW-A1(config-if)# switchport access vlan 99
ASW-A1(config-if)# exit
```

---

### ASW-B1: LWAP –ø–æ–¥–∫–ª—é—á–µ–Ω–∏–µ

```cisco
ASW-B1(config)# interface f0/1
ASW-B1(config-if)# switchport mode access
ASW-B1(config-if)# switchport nonegotiate
ASW-B1(config-if)# switchport access vlan 99
ASW-B1(config-if)# exit
```

---

### ASW-A2, A3, B2: PC + IP Phone

```cisco
! ASW-A2
ASW-A2(config)# interface f0/1
ASW-A2(config-if)# switchport mode access
ASW-A2(config-if)# switchport nonegotiate
ASW-A2(config-if)# switchport access vlan 10
ASW-A2(config-if)# switchport voice vlan 20
ASW-A2(config-if)# exit

! ASW-A3
ASW-A3(config)# interface f0/1
ASW-A3(config-if)# switchport mode access
ASW-A3(config-if)# switchport nonegotiate
ASW-A3(config-if)# switchport access vlan 10
ASW-A3(config-if)# switchport voice vlan 20
ASW-A3(config-if)# exit

! ASW-B2
ASW-B2(config)# interface f0/1
ASW-B2(config-if)# switchport mode access
ASW-B2(config-if)# switchport nonegotiate
ASW-B2(config-if)# switchport access vlan 10
ASW-B2(config-if)# switchport voice vlan 20
ASW-B2(config-if)# exit
```

üí° **Voice VLAN:**
- Data (PC) ‚Üí VLAN 10 (untagged)
- Voice (Phone) ‚Üí VLAN 20 (tagged)

---

### ASW-B3: Server –ø–æ–¥–∫–ª—é—á–µ–Ω–∏–µ

```cisco
ASW-B3(config)# interface f0/1
ASW-B3(config-if)# switchport mode access
ASW-B3(config-if)# switchport nonegotiate
ASW-B3(config-if)# switchport access vlan 30
ASW-B3(config-if)# exit
```

---

### –®–ê–ì 8: WLC1 –ø–æ–¥–∫–ª—é—á–µ–Ω–∏–µ (ASW-A1)

**–°–ø–µ—Ü–∏–∞–ª—å–Ω–∞—è –Ω–∞—Å—Ç—Ä–æ–π–∫–∞ –¥–ª—è WLC:**

```cisco
ASW-A1(config)# interface f0/2
ASW-A1(config-if)# switchport mode trunk
ASW-A1(config-if)# switchport trunk allowed vlan 40,99
ASW-A1(config-if)# switchport trunk native vlan 99
ASW-A1(config-if)# switchport nonegotiate
ASW-A1(config-if)# exit
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- VLAN 99 (Management) - native/untagged
- VLAN 40 (Wi-Fi) - tagged –¥–ª—è –∫–ª–∏–µ–Ω—Ç–æ–≤

---

## üìù –ß–ê–°–¢–¨ 6: Shutdown Unused Ports

### –®–ê–ì 9: –û—Ç–∫–ª—é—á–µ–Ω–∏–µ –Ω–µ–∏—Å–ø–æ–ª—å–∑—É–µ–º—ã—Ö –ø–æ—Ä—Ç–æ–≤

### Distribution Switches

```cisco
! DSW-A1, DSW-A2, DSW-B1, DSW-B2
DSW-A1(config)# interface range g1/0/6-24, g1/1/3-4
DSW-A1(config-if-range)# shutdown
DSW-A1(config-if-range)# exit
```

–ü–æ–≤—Ç–æ—Ä–∏—Ç–µ –Ω–∞ **DSW-A2, DSW-B1, DSW-B2**

---

### Access Switches

```cisco
! ASW-A1 (–æ—Å–æ–±—ã–π —Å–ª—É—á–∞–π - WLC –Ω–∞ F0/2)
ASW-A1(config)# interface range f0/3-24
ASW-A1(config-if-range)# shutdown
ASW-A1(config-if-range)# exit

! ASW-A2, A3, B1, B2, B3
ASW-A2(config)# interface range f0/2-24
ASW-A2(config-if-range)# shutdown
ASW-A2(config-if-range)# exit
```

–ü–æ–≤—Ç–æ—Ä–∏—Ç–µ –Ω–∞ **ASW-A3, ASW-B1, ASW-B2, ASW-B3**

---

## ‚úÖ –ü—Ä–æ–≤–µ—Ä–∫–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏

### 1. EtherChannel
```cisco
show etherchannel summary
```
–û–∂–∏–¥–∞–µ—Ç—Å—è: `Po1(SU)` –∏ —Ñ–ª–∞–≥ `P` –Ω–∞ –ø–æ—Ä—Ç–∞—Ö

### 2. Trunk
```cisco
show interfaces trunk
show interfaces g1/0/1 switchport
```

### 3. VTP
```cisco
show vtp status
```

### 4. VLANs
```cisco
show vlan brief
```

### 5. Access –ø–æ—Ä—Ç—ã
```cisco
show interfaces f0/1 switchport
```

### 6. –û—Ç–∫–ª—é—á–µ–Ω–Ω—ã–µ –ø–æ—Ä—Ç—ã
```cisco
show interfaces status | include disabled
```

---

## üìä –°–ø—Ä–∞–≤–æ—á–Ω—ã–µ —Ç–∞–±–ª–∏—Ü—ã

### VLANs Summary

| VLAN | –ù–∞–∑–≤–∞–Ω–∏–µ | Office A | Office B |
|------|----------|----------|----------|
| 10 | PCs | ‚úÖ | ‚úÖ |
| 20 | Phones | ‚úÖ | ‚úÖ |
| 30 | Servers | ‚ùå | ‚úÖ |
| 40 | Wi-Fi | ‚úÖ | ‚ùå |
| 99 | Management | ‚úÖ | ‚úÖ |

### EtherChannel Summary

| –°–≤—è–∑—å | –ü—Ä–æ—Ç–æ–∫–æ–ª | –†–µ–∂–∏–º | PortChannel |
|-------|----------|-------|-------------|
| DSW-A1 ‚Üî DSW-A2 | PAgP | desirable | Po1 |
| DSW-B1 ‚Üî DSW-B2 | LACP | active | Po1 |

### Access Ports Summary

| Switch | Port | VLAN | Voice | –£—Å—Ç—Ä–æ–π—Å—Ç–≤–æ |
|--------|------|------|-------|------------|
| ASW-A1 | F0/1 | 99 | - | LWAP1 |
| ASW-A1 | F0/2 | trunk | - | WLC1 |
| ASW-A2 | F0/1 | 10 | 20 | PC+Phone |
| ASW-A3 | F0/1 | 10 | 20 | PC+Phone |
| ASW-B1 | F0/1 | 99 | - | LWAP2 |
| ASW-B2 | F0/1 | 10 | 20 | PC+Phone |
| ASW-B3 | F0/1 | 30 | - | SRV1 |

---

## üí° –ü—Ä–∞–∫—Ç–∏—á–µ—Å–∫–∏–µ —Å–æ–≤–µ—Ç—ã

### –£—Å–∫–æ—Ä–µ–Ω–∏–µ —Ä–∞–±–æ—Ç—ã:
1. –ü–æ–¥–≥–æ—Ç–æ–≤—å—Ç–µ –∫–æ–º–∞–Ω–¥—ã –≤ Notepad
2. –ò—Å–ø–æ–ª—å–∑—É–π—Ç–µ Copy-Paste (–ø—Ä–∞–≤—ã–π –∫–ª–∏–∫ ‚Üí Paste)
3. –°–æ—Ö—Ä–∞–Ω—è–π—Ç–µ –ø–æ—Å–ª–µ –∫–∞–∂–¥–æ–≥–æ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞: `do write`

### –¢–∏–ø–∏—á–Ω—ã–µ –æ—à–∏–±–∫–∏:
‚ùå –ó–∞–±—ã—Ç—å `switchport nonegotiate`
‚ùå –ù–µ–ø—Ä–∞–≤–∏–ª—å–Ω—ã–π —Å–ø–∏—Å–æ–∫ VLAN (40 vs 30)
‚ùå –ó–∞–±—ã—Ç—å trunk –Ω–∞ PortChannel
‚ùå –ù–µ —É—Å—Ç–∞–Ω–æ–≤–∏—Ç—å VTP mode client
‚ùå –ó–∞–±—ã—Ç—å `do write`

---

## üéì –ö–ª—é—á–µ–≤—ã–µ –∫–æ–º–∞–Ω–¥—ã

```cisco
# EtherChannel
channel-group [number] mode {desirable|active}
show etherchannel summary

# Trunk
switchport mode trunk
switchport nonegotiate
switchport trunk native vlan [vlan-id]
switchport trunk allowed vlan [vlan-list]
show interfaces trunk

# VLAN
vlan [vlan-id]
name [name]
show vlan brief

# VTP
vtp domain [name]
vtp version 2
vtp mode {server|client|transparent}
show vtp status

# Access Port
switchport mode access
switchport access vlan [vlan-id]
switchport voice vlan [vlan-id]

# Shutdown
shutdown
show interfaces status
```

---

## üéØ –ß–µ–∫-–ª–∏—Å—Ç –∑–∞–≤–µ—Ä—à–µ–Ω–∏—è –ß–∞—Å—Ç–∏ 2

- [ ] EtherChannel PAgP –Ω–∞—Å—Ç—Ä–æ–µ–Ω (DSW-A1 ‚Üî A2)
- [ ] EtherChannel LACP –Ω–∞—Å—Ç—Ä–æ–µ–Ω (DSW-B1 ‚Üî B2)
- [ ] –í—Å–µ trunk –ø–æ—Ä—Ç—ã –Ω–∞—Å—Ç—Ä–æ–µ–Ω—ã
- [ ] VTP –Ω–∞—Å—Ç—Ä–æ–µ–Ω –≤ –æ–±–æ–∏—Ö –æ—Ñ–∏—Å–∞—Ö
- [ ] VLANs —Å–æ–∑–¥–∞–Ω—ã –∏ —Å–∏–Ω—Ö—Ä–æ–Ω–∏–∑–∏—Ä–æ–≤–∞–Ω—ã
- [ ] Access –ø–æ—Ä—Ç—ã –Ω–∞—Å—Ç—Ä–æ–µ–Ω—ã
- [ ] WLC1 trunk –Ω–∞—Å—Ç—Ä–æ–µ–Ω
- [ ] –ù–µ–∏—Å–ø–æ–ª—å–∑—É–µ–º—ã–µ –ø–æ—Ä—Ç—ã –æ—Ç–∫–ª—é—á–µ–Ω—ã
- [ ] –í—Å–µ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏ —Å–æ—Ö—Ä–∞–Ω–µ–Ω—ã

---

## üöÄ –ì–æ—Ç–æ–≤—ã –∫ –ß–∞—Å—Ç–∏ 3?

–í —Å–ª–µ–¥—É—é—â–µ–π —á–∞—Å—Ç–∏:
- **IPv4 –∞–¥—Ä–µ—Å–∞—Ü–∏—è** –Ω–∞ –≤—Å–µ—Ö —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞—Ö
- **Layer-3 EtherChannel** –º–µ–∂–¥—É Core switches
- **HSRP** –¥–ª—è —Ä–µ–∑–µ—Ä–≤–∏—Ä–æ–≤–∞–Ω–∏—è —à–ª—é–∑–æ–≤
- **Management IP** –Ω–∞ Access switches

**–î–æ –≤—Å—Ç—Ä–µ—á–∏ –≤ –ß–∞—Å—Ç–∏ 3! üéì**