# CCNA –ú–∏–Ω–∏-–∫—É—Ä—Å –Ω–∞ –æ—Å–Ω–æ–≤–µ Jeremy's Mega Lab
## –ß–∞—Å—Ç—å 3: IP Addressing, Layer-3 EtherChannel & HSRP

---

## üìã –¢–µ–æ—Ä–µ—Ç–∏—á–µ—Å–∫–∏–π –º–∏–Ω–∏–º—É–º

### –ö–ª—é—á–µ–≤—ã–µ –∫–æ–Ω—Ü–µ–ø—Ü–∏–∏:

**1. Layer-3 Interface** - –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä —Ä–∞–±–æ—Ç–∞–µ—Ç –Ω–∞ —É—Ä–æ–≤–Ω–µ –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ü–∏–∏
- Routed Port: `no switchport` –Ω–∞ —Ñ–∏–∑–∏—á–µ—Å–∫–æ–º –ø–æ—Ä—Ç—É
- SVI (Switch Virtual Interface): `interface vlan [id]`

**2. Layer-3 EtherChannel** - –∞–≥—Ä–µ–≥–∞—Ü–∏—è –Ω–∞ L3 —É—Ä–æ–≤–Ω–µ
- IP –∞–¥—Ä–µ—Å –Ω–∞—Å—Ç—Ä–∞–∏–≤–∞–µ—Ç—Å—è –Ω–∞ Port-channel –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–µ
- –§–∏–∑–∏—á–µ—Å–∫–∏–µ –ø–æ—Ä—Ç—ã: `no switchport` + `channel-group`

**3. HSRP (Hot Standby Router Protocol)** - Cisco proprietary
- –í–∏—Ä—Ç—É–∞–ª—å–Ω—ã–π IP (VIP) –¥–ª—è —Ä–µ–∑–µ—Ä–≤–∏—Ä–æ–≤–∞–Ω–∏—è —à–ª—é–∑–∞
- Active –∏ Standby —Ä–æ—É—Ç–µ—Ä—ã
- Priority: 0-255 (default 100)
- Preemption: –≤–æ–∑–≤—Ä–∞—Ç —Ä–æ–ª–∏ Active

**4. IP Routing –Ω–∞ –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä–∞—Ö**
- `ip routing` - –≤–∫–ª—é—á–µ–Ω–∏–µ –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ü–∏–∏
- Multilayer switches –º–æ–≥—É—Ç –±—ã—Ç—å –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ç–æ—Ä–∞–º–∏

---

## üéØ –¶–µ–ª–∏ —Ä–∞–∑–¥–µ–ª–∞

- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å IP –∞–¥—Ä–µ—Å–∞ –Ω–∞ R1
- ‚úÖ –í–∫–ª—é—á–∏—Ç—å IP routing –Ω–∞ –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä–∞—Ö
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å Layer-3 EtherChannel (CSW1 ‚Üî CSW2)
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å IP –∞–¥—Ä–µ—Å–∞ –Ω–∞ Core switches
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å IP –∞–¥—Ä–µ—Å–∞ –Ω–∞ Distribution switches
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å IP –∞–¥—Ä–µ—Å –Ω–∞ SRV1
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å Management IP –Ω–∞ Access switches
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å HSRP –¥–ª—è —Ä–µ–∑–µ—Ä–≤–∏—Ä–æ–≤–∞–Ω–∏—è

---

## üó∫Ô∏è IP Addressing Plan

### R1 Interfaces:
- G0/0/0: DHCP (Internet ISP A)
- G0/1/0: DHCP (Internet ISP B)
- G0/0: 10.0.0.33/30 (‚Üí CSW1)
- G0/1: 10.0.0.37/30 (‚Üí CSW2)
- Lo0: 10.0.0.76/32

### Core Switches:
- CSW1 Lo0: 10.0.0.77/32
- CSW2 Lo0: 10.0.0.78/32
- Po1: 10.0.0.40/30 (CSW1: .41, CSW2: .42)

### Distribution Switches Office A:
- DSW-A1 Lo0: 10.0.0.79/32
- DSW-A2 Lo0: 10.0.0.80/32

### Distribution Switches Office B:
- DSW-B1 Lo0: 10.0.0.81/32
- DSW-B2 Lo0: 10.0.0.82/32

---

## üìù –ß–ê–°–¢–¨ 1: R1 Configuration

### –®–ê–ì 1: –ù–∞—Å—Ç—Ä–æ–π–∫–∞ R1 Interfaces

```cisco
R1(config)# interface range g0/0/0, g0/1/0
R1(config-if-range)# ip address dhcp
R1(config-if-range)# no shutdown
R1(config-if-range)# exit

R1(config)# interface g0/0
R1(config-if)# ip address 10.0.0.33 255.255.255.252
R1(config-if)# no shutdown
R1(config-if)# exit

R1(config)# interface g0/1
R1(config-if)# ip address 10.0.0.37 255.255.255.252
R1(config-if)# no shutdown
R1(config-if)# exit

R1(config)# interface loopback 0
R1(config-if)# ip address 10.0.0.76 255.255.255.255
R1(config-if)# exit
R1(config)# do write
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
R1# show ip interface brief
```

–û–∂–∏–¥–∞–µ—Ç—Å—è:
- G0/0/0: –ø–æ–ª—É—á–∏–ª IP —á–µ—Ä–µ–∑ DHCP
- G0/1/0: –ø–æ–ª—É—á–∏–ª IP —á–µ—Ä–µ–∑ DHCP
- G0/0: 10.0.0.33
- G0/1: 10.0.0.37
- Lo0: 10.0.0.76

---

## üìù –ß–ê–°–¢–¨ 2: Enable IP Routing

### –®–ê–ì 2: –í–∫–ª—é—á–µ–Ω–∏–µ IP Routing –Ω–∞ –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä–∞—Ö

```cisco
! CSW1
CSW1(config)# ip routing

! CSW2
CSW2(config)# ip routing

! DSW-A1
DSW-A1(config)# ip routing

! DSW-A2
DSW-A2(config)# ip routing

! DSW-B1
DSW-B1(config)# ip routing

! DSW-B2
DSW-B2(config)# ip routing
```

üí° **–í–∞–∂–Ω–æ:** –ë–µ–∑ `ip routing` –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä –Ω–µ –±—É–¥–µ—Ç –º–∞—Ä—à—Ä—É—Ç–∏–∑–∏—Ä–æ–≤–∞—Ç—å –ø–∞–∫–µ—Ç—ã –º–µ–∂–¥—É VLAN!

---

## üìù –ß–ê–°–¢–¨ 3: Layer-3 EtherChannel

### –®–ê–ì 3: CSW1 ‚Üî CSW2 Layer-3 EtherChannel

**CSW1 Configuration:**
```cisco
CSW1(config)# interface range g1/0/2-3
CSW1(config-if-range)# no switchport
CSW1(config-if-range)# channel-group 1 mode desirable
CSW1(config-if-range)# exit

CSW1(config)# interface port-channel 1
CSW1(config-if)# ip address 10.0.0.41 255.255.255.252
CSW1(config-if)# exit
```

**CSW2 Configuration:**
```cisco
CSW2(config)# interface range g1/0/2-3
CSW2(config-if-range)# no switchport
CSW2(config-if-range)# channel-group 1 mode desirable
CSW2(config-if-range)# exit

CSW2(config)# interface port-channel 1
CSW2(config-if)# ip address 10.0.0.42 255.255.255.252
CSW2(config-if)# exit
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
CSW2# show etherchannel summary
```
–û–∂–∏–¥–∞–µ—Ç—Å—è: —Ñ–ª–∞–≥–∏ `RU` (Layer3, In use)

**–¢–µ—Å—Ç —Å–≤—è–∑–Ω–æ—Å—Ç–∏:**
```cisco
CSW2# ping 10.0.0.41
```

üí° **–ö–ª—é—á–µ–≤–æ–µ –æ—Ç–ª–∏—á–∏–µ L2 vs L3 EtherChannel:**
- L2: —Ñ–ª–∞–≥ `S` (Layer2), IP –Ω–∞ VLAN
- L3: —Ñ–ª–∞–≥ `R` (Layer3), IP –Ω–∞ Port-channel

---

## üìù –ß–ê–°–¢–¨ 4: Core Switches IP Configuration

### –®–ê–ì 4 –∏ 5: CSW1 –∏ CSW2

**CSW1:**
```cisco
CSW1(config)# interface g1/0/1
CSW1(config-if)# no switchport
CSW1(config-if)# ip address 10.0.0.34 255.255.255.252
CSW1(config-if)# no shutdown
CSW1(config-if)# exit

CSW1(config)# interface g1/1/1
CSW1(config-if)# no switchport
CSW1(config-if)# ip address 10.0.0.45 255.255.255.252
CSW1(config-if)# no shutdown
CSW1(config-if)# exit

CSW1(config)# interface g1/1/2
CSW1(config-if)# no switchport
CSW1(config-if)# ip address 10.0.0.49 255.255.255.252
CSW1(config-if)# no shutdown
CSW1(config-if)# exit

CSW1(config)# interface g1/1/3
CSW1(config-if)# no switchport
CSW1(config-if)# ip address 10.0.0.53 255.255.255.252
CSW1(config-if)# no shutdown
CSW1(config-if)# exit

CSW1(config)# interface g1/1/4
CSW1(config-if)# no switchport
CSW1(config-if)# ip address 10.0.0.57 255.255.255.252
CSW1(config-if)# no shutdown
CSW1(config-if)# exit

CSW1(config)# interface loopback 0
CSW1(config-if)# ip address 10.0.0.77 255.255.255.255
CSW1(config-if)# exit

CSW1(config)# interface range g1/0/4-24
CSW1(config-if-range)# shutdown
CSW1(config-if-range)# exit
CSW1(config)# do write
```

---

**CSW2:**
```cisco
CSW2(config)# interface g1/0/1
CSW2(config-if)# no switchport
CSW2(config-if)# ip address 10.0.0.38 255.255.255.252
CSW2(config-if)# no shutdown
CSW2(config-if)# exit

CSW2(config)# interface g1/1/1
CSW2(config-if)# no switchport
CSW2(config-if)# ip address 10.0.0.61 255.255.255.252
CSW2(config-if)# no shutdown
CSW2(config-if)# exit

CSW2(config)# interface g1/1/2
CSW2(config-if)# no switchport
CSW2(config-if)# ip address 10.0.0.65 255.255.255.252
CSW2(config-if)# no shutdown
CSW2(config-if)# exit

CSW2(config)# interface g1/1/3
CSW2(config-if)# no switchport
CSW2(config-if)# ip address 10.0.0.69 255.255.255.252
CSW2(config-if)# no shutdown
CSW2(config-if)# exit

CSW2(config)# interface g1/1/4
CSW2(config-if)# no switchport
CSW2(config-if)# ip address 10.0.0.73 255.255.255.252
CSW2(config-if)# no shutdown
CSW2(config-if)# exit

CSW2(config)# interface loopback 0
CSW2(config-if)# ip address 10.0.0.78 255.255.255.255
CSW2(config-if)# exit

CSW2(config)# interface range g1/0/4-24
CSW2(config-if-range)# shutdown
CSW2(config-if-range)# exit
CSW2(config)# do write
```

---

## üìù –ß–ê–°–¢–¨ 5: Distribution Switches

### –®–ê–ì 6-9: Distribution Switches IP Configuration

**DSW-A1:**
```cisco
DSW-A1(config)# interface g1/1/1
DSW-A1(config-if)# no switchport
DSW-A1(config-if)# ip address 10.0.0.46 255.255.255.252
DSW-A1(config-if)# no shutdown
DSW-A1(config-if)# exit

DSW-A1(config)# interface g1/1/2
DSW-A1(config-if)# no switchport
DSW-A1(config-if)# ip address 10.0.0.62 255.255.255.252
DSW-A1(config-if)# no shutdown
DSW-A1(config-if)# exit

DSW-A1(config)# interface loopback 0
DSW-A1(config-if)# ip address 10.0.0.79 255.255.255.255
DSW-A1(config-if)# exit
```

---

**DSW-A2:**
```cisco
DSW-A2(config)# interface g1/1/1
DSW-A2(config-if)# no switchport
DSW-A2(config-if)# ip address 10.0.0.50 255.255.255.252
DSW-A2(config-if)# no shutdown
DSW-A2(config-if)# exit

DSW-A2(config)# interface g1/1/2
DSW-A2(config-if)# no switchport
DSW-A2(config-if)# ip address 10.0.0.66 255.255.255.252
DSW-A2(config-if)# no shutdown
DSW-A2(config-if)# exit

DSW-A2(config)# interface loopback 0
DSW-A2(config-if)# ip address 10.0.0.80 255.255.255.255
DSW-A2(config-if)# exit
```

---

**DSW-B1:**
```cisco
DSW-B1(config)# interface g1/1/1
DSW-B1(config-if)# no switchport
DSW-B1(config-if)# ip address 10.0.0.54 255.255.255.252
DSW-B1(config-if)# no shutdown
DSW-B1(config-if)# exit

DSW-B1(config)# interface g1/1/2
DSW-B1(config-if)# no switchport
DSW-B1(config-if)# ip address 10.0.0.70 255.255.255.252
DSW-B1(config-if)# no shutdown
DSW-B1(config-if)# exit

DSW-B1(config)# interface loopback 0
DSW-B1(config-if)# ip address 10.0.0.81 255.255.255.255
DSW-B1(config-if)# exit
```

---

**DSW-B2:**
```cisco
DSW-B2(config)# interface g1/1/1
DSW-B2(config-if)# no switchport
DSW-B2(config-if)# ip address 10.0.0.58 255.255.255.252
DSW-B2(config-if)# no shutdown
DSW-B2(config-if)# exit

DSW-B2(config)# interface g1/1/2
DSW-B2(config-if)# no switchport
DSW-B2(config-if)# ip address 10.0.0.74 255.255.255.252
DSW-B2(config-if)# no shutdown
DSW-B2(config-if)# exit

DSW-B2(config)# interface loopback 0
DSW-B2(config-if)# ip address 10.0.0.82 255.255.255.255
DSW-B2(config-if)# exit
```

---

## üìù –ß–ê–°–¢–¨ 6: SRV1 Configuration

### –®–ê–ì 10: –ù–∞—Å—Ç—Ä–æ–π–∫–∞ SRV1 —á–µ—Ä–µ–∑ GUI

**–í Packet Tracer:**
1. –û—Ç–∫—Ä–æ–π—Ç–µ SRV1
2. –ü–µ—Ä–µ–π–¥–∏—Ç–µ –Ω–∞ –≤–∫–ª–∞–¥–∫—É **Config**
3. –í —Ä–∞–∑–¥–µ–ª–µ **GLOBAL** ‚Üí **Settings**:
   - Default Gateway: `10.5.0.1`
4. –í —Ä–∞–∑–¥–µ–ª–µ **INTERFACE** ‚Üí **FastEthernet0**:
   - IPv4 Address: `10.5.0.4`
   - Subnet Mask: `255.255.255.0`

üí° **–í–∞–∂–Ω–æ:** SRV1 –Ω–∞—Å—Ç—Ä–∞–∏–≤–∞–µ—Ç—Å—è —á–µ—Ä–µ–∑ GUI, –Ω–µ —á–µ—Ä–µ–∑ CLI!

---

## üìù –ß–ê–°–¢–¨ 7: Access Switches Management

### –®–ê–ì 11: Management IP –Ω–∞ Access Switches

**Office A (10.0.0.0/28):**

```cisco
! ASW-A1
ASW-A1(config)# ip default-gateway 10.0.0.1
ASW-A1(config)# interface vlan 99
ASW-A1(config-if)# ip address 10.0.0.4 255.255.255.240
ASW-A1(config-if)# exit
ASW-A1(config)# do write

! ASW-A2
ASW-A2(config)# ip default-gateway 10.0.0.1
ASW-A2(config)# interface vlan 99
ASW-A2(config-if)# ip address 10.0.0.5 255.255.255.240
ASW-A2(config-if)# exit
ASW-A2(config)# do write

! ASW-A3
ASW-A3(config)# ip default-gateway 10.0.0.1
ASW-A3(config)# interface vlan 99
ASW-A3(config-if)# ip address 10.0.0.6 255.255.255.240
ASW-A3(config-if)# exit
ASW-A3(config)# do write
```

---

**Office B (10.0.0.16/28):**

```cisco
! ASW-B1
ASW-B1(config)# ip default-gateway 10.0.0.17
ASW-B1(config)# interface vlan 99
ASW-B1(config-if)# ip address 10.0.0.20 255.255.255.240
ASW-B1(config-if)# exit
ASW-B1(config)# do write

! ASW-B2
ASW-B2(config)# ip default-gateway 10.0.0.17
ASW-B2(config)# interface vlan 99
ASW-B2(config-if)# ip address 10.0.0.21 255.255.255.240
ASW-B2(config-if)# exit
ASW-B2(config)# do write

! ASW-B3
ASW-B3(config)# ip default-gateway 10.0.0.17
ASW-B3(config)# interface vlan 99
ASW-B3(config-if)# ip address 10.0.0.22 255.255.255.240
ASW-B3(config-if)# exit
ASW-B3(config)# do write
```

üí° **–í–∞–∂–Ω–æ:** 
- L2 –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä—ã –∏—Å–ø–æ–ª—å–∑—É—é—Ç `ip default-gateway`
- L3 –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä—ã –∏—Å–ø–æ–ª—å–∑—É—é—Ç –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ü–∏—é

---

## üìù –ß–ê–°–¢–¨ 8: HSRP Configuration

### –ö–æ–Ω—Ü–µ–ø—Ü–∏—è HSRP –≤ –ª–∞–±–µ:

**Office A:**
- DSW-A1 = Active –¥–ª—è VLAN 10, 99
- DSW-A2 = Active –¥–ª—è VLAN 20, 40

**Office B:**
- DSW-B1 = Active –¥–ª—è VLAN 10, 99
- DSW-B2 = Active –¥–ª—è VLAN 20, 30

**HSRP Parameters:**
- Version: 2
- Priority: Active = 105, Standby = 100 (default)
- Preemption: —Ç–æ–ª—å–∫–æ –Ω–∞ Active

---

### –®–ê–ì 12: Office A - Management VLAN (Group 1)

**DSW-A1 (Active):**
```cisco
DSW-A1(config)# interface vlan 99
DSW-A1(config-if)# ip address 10.0.0.2 255.255.255.240
DSW-A1(config-if)# standby version 2
DSW-A1(config-if)# standby 1 ip 10.0.0.1
DSW-A1(config-if)# standby 1 priority 105
DSW-A1(config-if)# standby 1 preempt
DSW-A1(config-if)# exit
```

**DSW-A2 (Standby):**
```cisco
DSW-A2(config)# interface vlan 99
DSW-A2(config-if)# ip address 10.0.0.3 255.255.255.240
DSW-A2(config-if)# standby version 2
DSW-A2(config-if)# standby 1 ip 10.0.0.1
DSW-A2(config-if)# exit
```

---

### –®–ê–ì 13: Office A - PCs VLAN (Group 2)

**DSW-A1 (Active):**
```cisco
DSW-A1(config)# interface vlan 10
DSW-A1(config-if)# ip address 10.1.0.2 255.255.255.0
DSW-A1(config-if)# standby version 2
DSW-A1(config-if)# standby 2 ip 10.1.0.1
DSW-A1(config-if)# standby 2 priority 105
DSW-A1(config-if)# standby 2 preempt
DSW-A1(config-if)# exit
```

**DSW-A2 (Standby):**
```cisco
DSW-A2(config)# interface vlan 10
DSW-A2(config-if)# ip address 10.1.0.3 255.255.255.0
DSW-A2(config-if)# standby version 2
DSW-A2(config-if)# standby 2 ip 10.1.0.1
DSW-A2(config-if)# exit
```

---

### –®–ê–ì 14: Office A - Phones VLAN (Group 3)

**DSW-A2 (Active):**
```cisco
DSW-A2(config)# interface vlan 20
DSW-A2(config-if)# ip address 10.2.0.3 255.255.255.0
DSW-A2(config-if)# standby version 2
DSW-A2(config-if)# standby 3 ip 10.2.0.1
DSW-A2(config-if)# standby 3 priority 105
DSW-A2(config-if)# standby 3 preempt
DSW-A2(config-if)# exit
```

**DSW-A1 (Standby):**
```cisco
DSW-A1(config)# interface vlan 20
DSW-A1(config-if)# ip address 10.2.0.2 255.255.255.0
DSW-A1(config-if)# standby version 2
DSW-A1(config-if)# standby 3 ip 10.2.0.1
DSW-A1(config-if)# exit
```

---

### –®–ê–ì 15: Office A - Wi-Fi VLAN (Group 4)

**DSW-A2 (Active):**
```cisco
DSW-A2(config)# interface vlan 40
DSW-A2(config-if)# ip address 10.6.0.3 255.255.255.0
DSW-A2(config-if)# standby version 2
DSW-A2(config-if)# standby 4 ip 10.6.0.1
DSW-A2(config-if)# standby 4 priority 105
DSW-A2(config-if)# standby 4 preempt
DSW-A2(config-if)# exit
```

**DSW-A1 (Standby):**
```cisco
DSW-A1(config)# interface vlan 40
DSW-A1(config-if)# ip address 10.6.0.2 255.255.255.0
DSW-A1(config-if)# standby version 2
DSW-A1(config-if)# standby 4 ip 10.6.0.1
DSW-A1(config-if)# exit
```

**–°–æ—Ö—Ä–∞–Ω–µ–Ω–∏–µ:**
```cisco
DSW-A1(config)# do write
DSW-A2(config)# do write
```

---

### –®–ê–ì 16-19: Office B HSRP Configuration

**DSW-B1 - VLAN 99 (Group 1, Active):**
```cisco
DSW-B1(config)# interface vlan 99
DSW-B1(config-if)# ip address 10.0.0.18 255.255.255.240
DSW-B1(config-if)# standby version 2
DSW-B1(config-if)# standby 1 ip 10.0.0.17
DSW-B1(config-if)# standby 1 priority 105
DSW-B1(config-if)# standby 1 preempt
DSW-B1(config-if)# exit
```

**DSW-B2 - VLAN 99 (Group 1, Standby):**
```cisco
DSW-B2(config)# interface vlan 99
DSW-B2(config-if)# ip address 10.0.0.19 255.255.255.240
DSW-B2(config-if)# standby version 2
DSW-B2(config-if)# standby 1 ip 10.0.0.17
DSW-B2(config-if)# exit
```

---

**DSW-B1 - VLAN 10 (Group 2, Active):**
```cisco
DSW-B1(config)# interface vlan 10
DSW-B1(config-if)# ip address 10.3.0.2 255.255.255.0
DSW-B1(config-if)# standby version 2
DSW-B1(config-if)# standby 2 ip 10.3.0.1
DSW-B1(config-if)# standby 2 priority 105
DSW-B1(config-if)# standby 2 preempt
DSW-B1(config-if)# exit
```

**DSW-B2 - VLAN 10 (Group 2, Standby):**
```cisco
DSW-B2(config)# interface vlan 10
DSW-B2(config-if)# ip address 10.3.0.3 255.255.255.0
DSW-B2(config-if)# standby version 2
DSW-B2(config-if)# standby 2 ip 10.3.0.1
DSW-B2(config-if)# exit
```

---

**DSW-B2 - VLAN 20 (Group 3, Active):**
```cisco
DSW-B2(config)# interface vlan 20
DSW-B2(config-if)# ip address 10.4.0.3 255.255.255.0
DSW-B2(config-if)# standby version 2
DSW-B2(config-if)# standby 3 ip 10.4.0.1
DSW-B2(config-if)# standby 3 priority 105
DSW-B2(config-if)# standby 3 preempt
DSW-B2(config-if)# exit
```

**DSW-B1 - VLAN 20 (Group 3, Standby):**
```cisco
DSW-B1(config)# interface vlan 20
DSW-B1(config-if)# ip address 10.4.0.2 255.255.255.0
DSW-B1(config-if)# standby version 2
DSW-B1(config-if)# standby 3 ip 10.4.0.1
DSW-B1(config-if)# exit
```

---

**DSW-B2 - VLAN 30 (Group 4, Active):**
```cisco
DSW-B2(config)# interface vlan 30
DSW-B2(config-if)# ip address 10.5.0.3 255.255.255.0
DSW-B2(config-if)# standby version 2
DSW-B2(config-if)# standby 4 ip 10.5.0.1
DSW-B2(config-if)# standby 4 priority 105
DSW-B2(config-if)# standby 4 preempt
DSW-B2(config-if)# exit
```

**DSW-B1 - VLAN 30 (Group 4, Standby):**
```cisco
DSW-B1(config)# interface vlan 30
DSW-B1(config-if)# ip address 10.5.0.2 255.255.255.0
DSW-B1(config-if)# standby version 2
DSW-B1(config-if)# standby 4 ip 10.5.0.1
DSW-B1(config-if)# exit
```

**–°–æ—Ö—Ä–∞–Ω–µ–Ω–∏–µ:**
```cisco
DSW-B1(config)# do write
DSW-B2(config)# do write
```

---

## ‚úÖ –ü—Ä–æ–≤–µ—Ä–∫–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏

### 1. IP Connectivity
```cisco
R1# ping 10.0.0.34
CSW1# ping 10.0.0.42
DSW-A1# ping 10.0.0.46
```

### 2. HSRP Status
```cisco
DSW-A1# show standby brief
```

–û–∂–∏–¥–∞–µ—Ç—Å—è:
```
Vlan10  2   P   10.1.0.2    Active  local
Vlan99  1   P   10.0.0.2    Active  local
Vlan20  3       10.2.0.2    Standby remote
Vlan40  4       10.6.0.2    Standby remote
```

### 3. HSRP Virtual IP
```cisco
DSW-A1# show standby vlan 10
```

### 4. Ping –∏–∑ Access Switch
```cisco
ASW-A1# ping 10.0.0.1
```

---

## üìä HSRP Summary Tables

### Office A HSRP Groups

| Group | VLAN | VIP | Active | Standby |
|-------|------|-----|--------|---------|
| 1 | 99 (Mgmt) | .1 | DSW-A1 (.2) | DSW-A2 (.3) |
| 2 | 10 (PCs) | .1 | DSW-A1 (.2) | DSW-A2 (.3) |
| 3 | 20 (Phones) | .1 | DSW-A2 (.3) | DSW-A1 (.2) |
| 4 | 40 (Wi-Fi) | .1 | DSW-A2 (.3) | DSW-A1 (.2) |

### Office B HSRP Groups

| Group | VLAN | VIP | Active | Standby |
|-------|------|-----|--------|---------|
| 1 | 99 (Mgmt) | .17 | DSW-B1 (.18) | DSW-B2 (.19) |
| 2 | 10 (PCs) | .1 | DSW-B1 (.2) | DSW-B2 (.3) |
| 3 | 20 (Phones) | .1 | DSW-B2 (.3) | DSW-B1 (.2) |
| 4 | 30 (Servers) | .1 | DSW-B2 (.3) | DSW-B1 (.2) |

---

## üí° –ü—Ä–∞–∫—Ç–∏—á–µ—Å–∫–∏–µ —Å–æ–≤–µ—Ç—ã

### HSRP Troubleshooting:
```cisco
show standby brief           # –ö—Ä–∞—Ç–∫–∞—è –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è
show standby                 # –ü–æ–ª–Ω–∞—è –∏–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è
show standby vlan [id]       # –ö–æ–Ω–∫—Ä–µ—Ç–Ω—ã–π VLAN
debug standby                # –û—Ç–ª–∞–¥–∫–∞ (–æ—Å—Ç–æ—Ä–æ–∂–Ω–æ!)
```

### –¢–∏–ø–∏—á–Ω—ã–µ –æ—à–∏–±–∫–∏:
‚ùå –ó–∞–±—ã—Ç—å `standby version 2` - –ø–æ —É–º–æ–ª—á–∞–Ω–∏—é v1  
‚ùå –ù–µ–ø—Ä–∞–≤–∏–ª—å–Ω—ã–π priority –Ω–∞ Active  
‚ùå –ó–∞–±—ã—Ç—å `preempt` –Ω–∞ Active —Ä–æ—É—Ç–µ—Ä–µ  
‚ùå –ù–µ–ø—Ä–∞–≤–∏–ª—å–Ω—ã–π group number  
‚ùå –ù–µ—Å–æ–≤–ø–∞–¥–µ–Ω–∏–µ VIP –º–µ–∂–¥—É —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞–º–∏  

---

## üéì –ö–ª—é—á–µ–≤—ã–µ –∫–æ–º–∞–Ω–¥—ã –ß–∞—Å—Ç–∏ 3

```cisco
# IP Addressing
interface [type] [number]
 ip address [ip] [mask]
 no shutdown

# Layer-3 Interface
no switchport

# IP Routing
ip routing

# HSRP
standby version 2
standby [group] ip [vip]
standby [group] priority [value]
standby [group] preempt

# Verification
show ip interface brief
show interfaces [type] [number]
show standby brief
show standby vlan [id]
ping [ip]
```

---

## üéØ –ß–µ–∫-–ª–∏—Å—Ç –∑–∞–≤–µ—Ä—à–µ–Ω–∏—è –ß–∞—Å—Ç–∏ 3

- [ ] R1 –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å—ã –Ω–∞—Å—Ç—Ä–æ–µ–Ω—ã (DHCP + —Å—Ç–∞—Ç–∏—á–µ—Å–∫–∏–µ)
- [ ] IP routing –≤–∫–ª—é—á–µ–Ω –Ω–∞ –≤—Å–µ—Ö L3 –∫–æ–º–º—É—Ç–∞—Ç–æ—Ä–∞—Ö
- [ ] Layer-3 EtherChannel —Ä–∞–±–æ—Ç–∞–µ—Ç (CSW1 ‚Üî CSW2)
- [ ] IP –∞–¥—Ä–µ—Å–∞ –Ω–∞ Core switches –Ω–∞—Å—Ç—Ä–æ–µ–Ω—ã
- [ ] IP –∞–¥—Ä–µ—Å–∞ –Ω–∞ Distribution switches –Ω–∞—Å—Ç—Ä–æ–µ–Ω—ã
- [ ] SRV1 IP –Ω–∞—Å—Ç—Ä–æ–µ–Ω —á–µ—Ä–µ–∑ GUI
- [ ] Management IP –Ω–∞ Access switches –Ω–∞—Å—Ç—Ä–æ–µ–Ω—ã
- [ ] HSRP Group 1, 2 –≤ Office A —Ä–∞–±–æ—Ç–∞–µ—Ç
- [ ] HSRP Group 3, 4 –≤ Office A —Ä–∞–±–æ—Ç–∞–µ—Ç
- [ ] HSRP Group 1, 2 –≤ Office B —Ä–∞–±–æ—Ç–∞–µ—Ç
- [ ] HSRP Group 3, 4 –≤ Office B —Ä–∞–±–æ—Ç–∞–µ—Ç
- [ ] –í—Å–µ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏ —Å–æ—Ö—Ä–∞–Ω–µ–Ω—ã (`do write`)
- [ ] Ping —Ç–µ—Å—Ç—ã —É—Å–ø–µ—à–Ω—ã

---

## üß™ –¢–µ—Å—Ç–∏—Ä–æ–≤–∞–Ω–∏–µ HSRP

### –¢–µ—Å—Ç 1: –ü—Ä–æ–≤–µ—Ä–∫–∞ Active/Standby
```cisco
DSW-A1# show standby brief
DSW-A2# show standby brief
```

### –¢–µ—Å—Ç 2: Failover —Ç–µ—Å—Ç
```cisco
! –ù–∞ Active —Ä–æ—É—Ç–µ—Ä–µ –æ—Ç–∫–ª—é—á–∏—Ç—å –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å
DSW-A1(config)# interface vlan 10
DSW-A1(config-if)# shutdown

! –ù–∞ Standby –¥–æ–ª–∂–µ–Ω —Å–º–µ–Ω–∏—Ç—å—Å—è —Å—Ç–∞—Ç—É—Å
DSW-A2# show standby brief
! –¢–µ–ø–µ—Ä—å DSW-A2 –¥–æ–ª–∂–µ–Ω –±—ã—Ç—å Active

! –í–∫–ª—é—á–∏—Ç—å –æ–±—Ä–∞—Ç–Ω–æ
DSW-A1(config-if)# no shutdown
! –ë–ª–∞–≥–æ–¥–∞—Ä—è preempt, DSW-A1 –≤–µ—Ä–Ω—ë—Ç —Ä–æ–ª—å Active
```

### –¢–µ—Å—Ç 3: Ping VIP
```cisco
ASW-A1# ping 10.0.0.1
ASW-A2# ping 10.1.0.1
```

---

## üìä IP Addressing Reference

### Loopback Addresses
| Device | Loopback IP |
|--------|-------------|
| R1 | 10.0.0.76/32 |
| CSW1 | 10.0.0.77/32 |
| CSW2 | 10.0.0.78/32 |
| DSW-A1 | 10.0.0.79/32 |
| DSW-A2 | 10.0.0.80/32 |
| DSW-B1 | 10.0.0.81/32 |
| DSW-B2 | 10.0.0.82/32 |

### Point-to-Point Links (/30)
| Link | Subnet | Device 1 | Device 2 |
|------|--------|----------|----------|
| R1 ‚Üî CSW1 | 10.0.0.32/30 | .33 | .34 |
| R1 ‚Üî CSW2 | 10.0.0.36/30 | .37 | .38 |
| CSW1 ‚Üî CSW2 | 10.0.0.40/30 | .41 | .42 |
| CSW1 ‚Üî DSW-A1 | 10.0.0.44/30 | .45 | .46 |
| CSW1 ‚Üî DSW-A2 | 10.0.0.48/30 | .49 | .50 |
| CSW1 ‚Üî DSW-B1 | 10.0.0.52/30 | .53 | .54 |
| CSW1 ‚Üî DSW-B2 | 10.0.0.56/30 | .57 | .58 |
| CSW2 ‚Üî DSW-A1 | 10.0.0.60/30 | .61 | .62 |
| CSW2 ‚Üî DSW-A2 | 10.0.0.64/30 | .65 | .66 |
| CSW2 ‚Üî DSW-B1 | 10.0.0.68/30 | .69 | .70 |
| CSW2 ‚Üî DSW-B2 | 10.0.0.72/30 | .73 | .74 |

---

## üöÄ –ì–æ—Ç–æ–≤—ã –∫ –ß–∞—Å—Ç–∏ 4?

–í —Å–ª–µ–¥—É—é—â–µ–π —á–∞—Å—Ç–∏ –º—ã –Ω–∞—Å—Ç—Ä–æ–∏–º:
- **Rapid PVST+** - –±—ã—Å—Ç—Ä—ã–π Spanning Tree
- **Root Bridge** - –æ–ø—Ä–µ–¥–µ–ª–µ–Ω–∏–µ –∫–æ—Ä–Ω–µ–≤–æ–≥–æ –º–æ—Å—Ç–∞
- **STP Priority** - –Ω–∞—Å—Ç—Ä–æ–π–∫–∞ –ø—Ä–∏–æ—Ä–∏—Ç–µ—Ç–æ–≤
- **PortFast** - –±—ã—Å—Ç—Ä–æ–µ –≤–∫–ª—é—á–µ–Ω–∏–µ –ø–æ—Ä—Ç–æ–≤
- **BPDU Guard** - –∑–∞—â–∏—Ç–∞ –æ—Ç –ø–µ—Ç–µ–ª—å

**–î–æ –≤—Å—Ç—Ä–µ—á–∏ –≤ –ß–∞—Å—Ç–∏ 4! üéì**