# CCNA –ú–∏–Ω–∏-–∫—É—Ä—Å - BONUS
## –ß–∞—Å—Ç—å 10: BGP Basics (Beyond CCNA Scope)

---

## ‚ö†Ô∏è –í–ê–ñ–ù–û–ï –ü–†–ï–î–£–ü–†–ï–ñ–î–ï–ù–ò–ï

**BGP –ù–ï –í–•–û–î–ò–¢ –í CCNA 200-301!**

–≠—Ç–æ—Ç –º–∞—Ç–µ—Ä–∏–∞–ª:
- üéì **–£—Ä–æ–≤–µ–Ω—å:** CCNP Enterprise / Service Provider
- üìö **–¶–µ–ª—å:** –î–æ–ø–æ–ª–Ω–∏—Ç–µ–ª—å–Ω–æ–µ –æ–±—É—á–µ–Ω–∏–µ
- ‚ö†Ô∏è **–ù–ï —Ç—Ä–µ–±—É–µ—Ç—Å—è** –¥–ª—è CCNA —ç–∫–∑–∞–º–µ–Ω–∞
- üí° **–ü–æ–ª–µ–∑–Ω–æ:** –î–ª—è –ø–æ–Ω–∏–º–∞–Ω–∏—è Enterprise/ISP —Å–µ—Ç–µ–π

**–ï—Å–ª–∏ –≤—ã –≥–æ—Ç–æ–≤–∏—Ç–µ—Å—å –∫ CCNA - —Å–Ω–∞—á–∞–ª–∞ —Å–¥–∞–π—Ç–µ —ç–∫–∑–∞–º–µ–Ω!**

---

## üìã –¢–µ–æ—Ä–µ—Ç–∏—á–µ—Å–∫–∏–π –º–∏–Ω–∏–º—É–º BGP

### –ß—Ç–æ —Ç–∞–∫–æ–µ BGP?

**BGP (Border Gateway Protocol)** - –ø—Ä–æ—Ç–æ–∫–æ–ª –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ü–∏–∏ –¥–ª—è Internet:
- Path-vector –ø—Ä–æ—Ç–æ–∫–æ–ª
- Exterior Gateway Protocol (EGP)
- –°–≤—è–∑—ã–≤–∞–µ—Ç —Ä–∞–∑–Ω—ã–µ Autonomous Systems (AS)
- –ò—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è ISP –∏ –∫—Ä—É–ø–Ω—ã–º–∏ Enterprise

### –ö–ª—é—á–µ–≤—ã–µ –∫–æ–Ω—Ü–µ–ø—Ü–∏–∏:

**1. Autonomous System (AS)**
- –ì—Ä—É–ø–ø–∞ —Å–µ—Ç–µ–π –ø–æ–¥ –µ–¥–∏–Ω—ã–º –∞–¥–º–∏–Ω–∏—Å—Ç—Ä–∞—Ç–∏–≤–Ω—ã–º —É–ø—Ä–∞–≤–ª–µ–Ω–∏–µ–º
- AS Number (ASN): 16-bit (1-65535) –∏–ª–∏ 32-bit
- Private ASN: 64512-65534
- Public ASN: –≤—ã–¥–∞—ë—Ç—Å—è IANA/RIR

**2. BGP Neighbors (Peers)**
- –†—É—á–Ω–∞—è –Ω–∞—Å—Ç—Ä–æ–π–∫–∞ (–Ω–µ –∞–≤—Ç–æ–º–∞—Ç–∏—á–µ—Å–∫–æ–µ –æ–±–Ω–∞—Ä—É–∂–µ–Ω–∏–µ)
- TCP port 179 –¥–ª—è —Å–æ–µ–¥–∏–Ω–µ–Ω–∏—è
- Must be reachable (–æ–±—ã—á–Ω–æ —á–µ—Ä–µ–∑ IGP –∏–ª–∏ static routes)

**3. eBGP vs iBGP**
- **eBGP** (External BGP): –º–µ–∂–¥—É —Ä–∞–∑–Ω—ã–º–∏ AS
- **iBGP** (Internal BGP): –≤–Ω—É—Ç—Ä–∏ –æ–¥–Ω–æ–≥–æ AS
- eBGP AD: 20
- iBGP AD: 200

**4. BGP Path Selection**
- –ò—Å–ø–æ–ª—å–∑—É–µ—Ç –∞—Ç—Ä–∏–±—É—Ç—ã –¥–ª—è –≤—ã–±–æ—Ä–∞ best path
- –ù–ï –∏—Å–ø–æ–ª—å–∑—É–µ—Ç –º–µ—Ç—Ä–∏–∫—É (–∫–∞–∫ OSPF cost)
- –ê–ª–≥–æ—Ä–∏—Ç–º –∏–∑ 13+ —à–∞–≥–æ–≤

**5. BGP Attributes**
- **WEIGHT** (Cisco-proprietary, –ª–æ–∫–∞–ª—å–Ω—ã–π)
- **LOCAL_PREF** (–≤–Ω—É—Ç—Ä–∏ AS)
- **AS_PATH** (–∫–æ–ª–∏—á–µ—Å—Ç–≤–æ AS –≤ –ø—É—Ç–∏)
- **ORIGIN** (IGP > EGP > Incomplete)
- **MED** (Multi-Exit Discriminator)
- **Next-hop** (IP —Å–ª–µ–¥—É—é—â–µ–≥–æ hop)

---

## üéØ –¶–µ–ª–∏ Bonus —Ä–∞–∑–¥–µ–ª–∞

- ‚úÖ –ü–æ–Ω—è—Ç—å –∫–æ–Ω—Ü–µ–ø—Ü–∏—é BGP –∏ AS
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å eBGP –º–µ–∂–¥—É R1 –∏ ISP
- ‚úÖ –ü–æ–Ω—è—Ç—å BGP attributes
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å BGP route filtering
- ‚úÖ –ò—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å BGP –≤–º–µ—Å—Ç–æ static routes
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å BGP route advertisement

---

## üó∫Ô∏è BGP Design –¥–ª—è Mega Lab

### –ò–∑–º–µ–Ω–µ–Ω–∏—è –≤ —Ç–æ–ø–æ–ª–æ–≥–∏–∏:

**–¢–µ–∫—É—â–∞—è –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è (Static Routes):**
```
R1 --- Static Route ---> ISP A (203.0.113.1)
R1 --- Static Route ---> ISP B (203.0.113.5)
```

**–ù–æ–≤–∞—è –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è (BGP):**
```
R1 (AS 65001) --- eBGP ---> ISP A (AS 65100)
R1 (AS 65001) --- eBGP ---> ISP B (AS 65200)
```

### AS Numbers:
- **R1 (Enterprise)**: AS 65001 (Private ASN)
- **ISP A**: AS 65100 (Private ASN –¥–ª—è –ª–∞–±—ã)
- **ISP B**: AS 65200 (Private ASN –¥–ª—è –ª–∞–±—ã)

### BGP Neighbors:
- R1 ‚Üî ISP A: 203.0.113.1 (neighbor)
- R1 ‚Üî ISP B: 203.0.113.5 (neighbor)

### Advertised Networks:
- R1 ‚Üí ISPs: Internal networks (10.0.0.0/8)
- ISPs ‚Üí R1: Default route (0.0.0.0/0)

---

## üìù –ß–ê–°–¢–¨ 1: –ü–æ–¥–≥–æ—Ç–æ–≤–∫–∞ - –£–¥–∞–ª–µ–Ω–∏–µ Static Routes

### –®–ê–ì 1: –£–¥–∞–ª–µ–Ω–∏–µ —Å—É—â–µ—Å—Ç–≤—É—é—â–∏—Ö Static Routes –Ω–∞ R1

‚ö†Ô∏è **–í–∞–∂–Ω–æ:** –°–Ω–∞—á–∞–ª–∞ —É–¥–∞–ª–∏–º static routes, –∫–æ—Ç–æ—Ä—ã–µ –º—ã –Ω–∞—Å—Ç—Ä–æ–∏–ª–∏ –≤ –ß–∞—Å—Ç–∏ 5.

```cisco
R1(config)# no ip route 0.0.0.0 0.0.0.0 203.0.113.1
R1(config)# no ip route 0.0.0.0 0.0.0.0 203.0.113.5 2
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
R1# show ip route static
! –ù–µ –¥–æ–ª–∂–Ω–æ –±—ã—Ç—å static default routes
```

**–¢–∞–∫–∂–µ —É–¥–∞–ª–∏–º OSPF default route advertisement:**
```cisco
R1(config)# router ospf 1
R1(config-router)# no default-information originate
R1(config-router)# exit
```

üí° –ü–æ—Å–ª–µ —ç—Ç–æ–≥–æ –≤–Ω—É—Ç—Ä–µ–Ω–Ω–∏–µ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –ø–æ—Ç–µ—Ä—è—é—Ç –¥–æ—Å—Ç—É–ø –∫ Internet - –≤—Ä–µ–º–µ–Ω–Ω–æ, –ø–æ–∫–∞ –Ω–µ –Ω–∞—Å—Ç—Ä–æ–∏–º BGP.

---

## üìù –ß–ê–°–¢–¨ 2: –ë–∞–∑–æ–≤–∞—è –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è BGP

### –®–ê–ì 2: –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è BGP –Ω–∞ R1

**–°–æ–∑–¥–∞–Ω–∏–µ BGP –ø—Ä–æ—Ü–µ—Å—Å–∞:**
```cisco
R1(config)# router bgp 65001
R1(config-router)# bgp router-id 10.0.0.76
R1(config-router)# bgp log-neighbor-changes
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `router bgp 65001` - —Å–æ–∑–¥–∞—ë—Ç BGP –ø—Ä–æ—Ü–µ—Å—Å —Å ASN 65001
- `bgp router-id` - —Ä—É—á–Ω–∞—è –Ω–∞—Å—Ç—Ä–æ–π–∫–∞ Router ID (best practice)
- `bgp log-neighbor-changes` - –ª–æ–≥–∏—Ä–æ–≤–∞–Ω–∏–µ –∏–∑–º–µ–Ω–µ–Ω–∏–π —Å–æ—Å–µ–¥–µ–π

---

### –®–ê–ì 2 (–ø—Ä–æ–¥–æ–ª–∂–µ–Ω–∏–µ): –ù–∞—Å—Ç—Ä–æ–π–∫–∞ eBGP Neighbors

**Neighbor –∫ ISP A:**
```cisco
R1(config-router)# neighbor 203.0.113.1 remote-as 65100
R1(config-router)# neighbor 203.0.113.1 description ISP-A
```

**Neighbor –∫ ISP B:**
```cisco
R1(config-router)# neighbor 203.0.113.5 remote-as 65200
R1(config-router)# neighbor 203.0.113.5 description ISP-B
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `neighbor [ip] remote-as [asn]` - –æ–ø—Ä–µ–¥–µ–ª—è–µ—Ç BGP —Å–æ—Å–µ–¥–∞
- `remote-as` –æ—Ç–ª–∏—á–∞–µ—Ç—Å—è –æ—Ç –ª–æ–∫–∞–ª—å–Ω–æ–≥–æ ‚Üí —ç—Ç–æ eBGP
- `description` - –¥–ª—è –¥–æ–∫—É–º–µ–Ω—Ç–∞—Ü–∏–∏

---

### –®–ê–ì 2 (–ø—Ä–æ–¥–æ–ª–∂–µ–Ω–∏–µ): Network Advertisement

**–ê–Ω–æ–Ω—Å–∏—Ä–æ–≤–∞–Ω–∏–µ —Å–µ—Ç–µ–π –≤ BGP:**

```cisco
R1(config-router)# network 10.0.0.0 mask 255.0.0.0
R1(config-router)# exit
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `network` - –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç —Å–µ—Ç—å –≤ BGP
- –°–µ—Ç—å –î–û–õ–ñ–ù–ê —Å—É—â–µ—Å—Ç–≤–æ–≤–∞—Ç—å –≤ routing table
- –ú—ã –∞–Ω–æ–Ω—Å–∏—Ä—É–µ–º 10.0.0.0/8 (–≤—Å–µ –Ω–∞—à–∏ –≤–Ω—É—Ç—Ä–µ–Ω–Ω–∏–µ —Å–µ—Ç–∏)

üí° **–í–∞–∂–Ω–æ:** BGP `network` –∫–æ–º–∞–Ω–¥–∞ –æ—Ç–ª–∏—á–∞–µ—Ç—Å—è –æ—Ç OSPF - –Ω—É–∂–µ–Ω mask!

---

## üìù –ß–ê–°–¢–¨ 3: –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è ISP Routers

‚ö†Ô∏è **–ü—Ä–∏–º–µ—á–∞–Ω–∏–µ:** –í —Ä–µ–∞–ª—å–Ω–æ–π –ª–∞–±–µ Jeremy's Mega Lab ISP —Ä–æ—É—Ç–µ—Ä—ã —É–∂–µ –Ω–∞—Å—Ç—Ä–æ–µ–Ω—ã. –ù–æ –¥–ª—è –ø–æ–ª–Ω–æ–≥–æ –ø–æ–Ω–∏–º–∞–Ω–∏—è –ø–æ–∫–∞–∂—É –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—é.

### –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è ISP A (–¥–ª—è —Å–ø—Ä–∞–≤–∫–∏)

```cisco
! ISP A Router
router bgp 65100
 bgp router-id 203.0.113.1
 neighbor 203.0.113.2 remote-as 65001
 neighbor 203.0.113.2 description Customer-R1
 network 0.0.0.0
```

### –ö–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è ISP B (–¥–ª—è —Å–ø—Ä–∞–≤–∫–∏)

```cisco
! ISP B Router
router bgp 65200
 bgp router-id 203.0.113.5
 neighbor 203.0.113.6 remote-as 65001
 neighbor 203.0.113.6 description Customer-R1
 network 0.0.0.0
```

üí° ISP –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç default route (0.0.0.0/0) –¥–ª—è –≤—ã—Ö–æ–¥–∞ –≤ Internet.

---

## üìù –ß–ê–°–¢–¨ 4: –ü—Ä–æ–≤–µ—Ä–∫–∞ BGP Neighbors

### –®–ê–ì 3: –ü—Ä–æ–≤–µ—Ä–∫–∞ BGP —Å–æ—Å–µ–¥—Å—Ç–≤–∞

**–ü—Ä–æ–≤–µ—Ä–∫–∞ BGP neighbors:**
```cisco
R1# show ip bgp summary
```

**–û–∂–∏–¥–∞–µ–º—ã–π –≤—ã–≤–æ–¥:**
```
BGP router identifier 10.0.0.76, local AS number 65001

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
203.0.113.1     4 65100       5       5        5    0    0 00:01:23        1
203.0.113.5     4 65200       5       5        5    0    0 00:01:20        1
```

**–ö–ª—é—á–µ–≤—ã–µ —Å—Ç–æ–ª–±—Ü—ã:**
- **Neighbor**: IP –∞–¥—Ä–µ—Å BGP peer
- **AS**: Remote AS number
- **State/PfxRcd**: –ö–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø–æ–ª—É—á–µ–Ω–Ω—ã—Ö –ø—Ä–µ—Ñ–∏–∫—Å–æ–≤ (–∏–ª–∏ —Å–æ—Å—Ç–æ—è–Ω–∏–µ)

‚úÖ **–ï—Å–ª–∏ –≤–∏–¥–∏—Ç–µ —Ü–∏—Ñ—Ä—É (1) - —Å–æ—Å–µ–¥—Å—Ç–≤–æ —É—Å—Ç–∞–Ω–æ–≤–ª–µ–Ω–æ!**

‚ùå **–ï—Å–ª–∏ –≤–∏–¥–∏—Ç–µ Idle, Active, Connect - –ø—Ä–æ–±–ª–µ–º—ã —Å —Å–æ—Å–µ–¥—Å—Ç–≤–æ–º**

---

### –î–µ—Ç–∞–ª—å–Ω–∞—è –ø—Ä–æ–≤–µ—Ä–∫–∞ neighbor

```cisco
R1# show ip bgp neighbors 203.0.113.1
```

–°–º–æ—Ç—Ä–∏—Ç–µ –Ω–∞:
- **BGP state**: Established (—Ö–æ—Ä–æ—à–æ) vs Idle/Active (–ø–ª–æ—Ö–æ)
- **Prefixes received**: —Å–∫–æ–ª—å–∫–æ –º–∞—Ä—à—Ä—É—Ç–æ–≤ –ø–æ–ª—É—á–µ–Ω–æ
- **Connection attempts**: –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø–æ–ø—ã—Ç–æ–∫ –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è

---

## üìù –ß–ê–°–¢–¨ 5: BGP Routing Table

### –®–ê–ì 4: –ü—Ä–æ–≤–µ—Ä–∫–∞ BGP Table

**–ü–æ—Å–º–æ—Ç—Ä–µ—Ç—å BGP —Ç–∞–±–ª–∏—Ü—É:**
```cisco
R1# show ip bgp
```

**–û–∂–∏–¥–∞–µ–º—ã–π –≤—ã–≤–æ–¥:**
```
   Network          Next Hop            Metric LocPrf Weight Path
*> 0.0.0.0          203.0.113.1              0             0 65100 i
*                   203.0.113.5              0             0 65200 i
*> 10.0.0.0         0.0.0.0                  0         32768 i
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ —Å–∏–º–≤–æ–ª–æ–≤:**
- `*` - valid route
- `>` - best route (–≤—ã–±—Ä–∞–Ω–Ω—ã–π –ø—É—Ç—å)
- `i` - origin (IGP)

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ –º–∞—Ä—à—Ä—É—Ç–æ–≤:**
- **0.0.0.0/0**: Default route –æ—Ç –æ–±–æ–∏—Ö ISP
- **Best path**: —á–µ—Ä–µ–∑ ISP A (203.0.113.1)
- **10.0.0.0/8**: –õ–æ–∫–∞–ª—å–Ω–∞—è —Å–µ—Ç—å (–∞–Ω–æ–Ω—Å–∏—Ä—É–µ–º –º—ã)

---

### –ü—Ä–æ–≤–µ—Ä–∫–∞ IP routing table

```cisco
R1# show ip route bgp
```

**–û–∂–∏–¥–∞–µ–º—ã–π –≤—ã–≤–æ–¥:**
```
B*    0.0.0.0/0 [20/0] via 203.0.113.1, 00:05:23
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `B` - BGP route
- `*` - candidate default route
- `[20/0]` - AD 20, metric 0
- Best path –≤—ã–±—Ä–∞–Ω (—á–µ—Ä–µ–∑ ISP A)

‚úÖ Default route —Ç–µ–ø–µ—Ä—å –ø–æ–ª—É—á–∞–µ–º —á–µ—Ä–µ–∑ BGP!

---

## üìù –ß–ê–°–¢–¨ 6: BGP Route Advertisement –≤ OSPF

### –®–ê–ì 5: –†–µ–¥–∏—Å—Ç—Ä–∏–±—É—Ü–∏—è BGP –≤ OSPF

**–ü—Ä–æ–±–ª–µ–º–∞:** –í–Ω—É—Ç—Ä–µ–Ω–Ω–∏–µ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ –Ω–µ –≤–∏–¥—è—Ç BGP –º–∞—Ä—à—Ä—É—Ç—ã.

**–†–µ—à–µ–Ω–∏–µ:** Redistribute BGP routes –≤ OSPF.

```cisco
R1(config)# router ospf 1
R1(config-router)# redistribute bgp 65001 subnets
R1(config-router)# exit
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `redistribute bgp` - –±–µ—Ä—ë—Ç BGP routes –∏ –≤—Å—Ç–∞–≤–ª—è–µ—Ç –≤ OSPF
- `subnets` - –≤–∫–ª—é—á–∞—è subnets (–æ–±—è–∑–∞—Ç–µ–ª—å–Ω–æ!)
- OSPF –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç —ç—Ç–∏ –º–∞—Ä—à—Ä—É—Ç—ã –≤–Ω—É—Ç—Ä—å —Å–µ—Ç–∏

**–ê–ª—å—Ç–µ—Ä–Ω–∞—Ç–∏–≤–∞ (–ø—Ä–æ—â–µ):**
```cisco
R1(config)# router ospf 1
R1(config-router)# default-information originate
R1(config-router)# exit
```

–≠—Ç–æ –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç —Ç–æ–ª—å–∫–æ default route, –Ω–µ –≤—Å–µ BGP routes.

---

### –ü—Ä–æ–≤–µ—Ä–∫–∞ –Ω–∞ –≤–Ω—É—Ç—Ä–µ–Ω–Ω–∏—Ö —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞—Ö

**–ù–∞ DSW-A1:**
```cisco
DSW-A1# show ip route
```

–î–æ–ª–∂–Ω—ã –≤–∏–¥–µ—Ç—å:
```
O*E2  0.0.0.0/0 [110/1] via 10.0.0.45, GigabitEthernet1/1/1
                [110/1] via 10.0.0.61, GigabitEthernet1/1/2
```

‚úÖ –í–Ω—É—Ç—Ä–µ–Ω–Ω–∏–µ —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞ —Å–Ω–æ–≤–∞ –∏–º–µ—é—Ç default route!

---

## üìù –ß–ê–°–¢–¨ 7: BGP Path Selection

### –ü–æ–Ω–∏–º–∞–Ω–∏–µ BGP Best Path Selection

BGP –∏—Å–ø–æ–ª—å–∑—É–µ—Ç **–∞–ª–≥–æ—Ä–∏—Ç–º –∏–∑ 13+ —à–∞–≥–æ–≤** –¥–ª—è –≤—ã–±–æ—Ä–∞ best path:

**–û—Å–Ω–æ–≤–Ω—ã–µ —à–∞–≥–∏ (—É–ø—Ä–æ—â—ë–Ω–Ω–æ):**
1. **Weight** (–≤—ã—à–µ = –ª—É—á—à–µ) - Cisco only
2. **Local Preference** (–≤—ã—à–µ = –ª—É—á—à–µ) - –≤–Ω—É—Ç—Ä–∏ AS
3. **Locally originated** (prefer local)
4. **AS-PATH** (–∫–æ—Ä–æ—á–µ = –ª—É—á—à–µ)
5. **Origin** (IGP > EGP > incomplete)
6. **MED** (–Ω–∏–∂–µ = –ª—É—á—à–µ)
7. **eBGP > iBGP**
8. **IGP metric** –∫ next-hop
9. **Oldest route** (—Å—Ç–∞–±–∏–ª—å–Ω–æ—Å—Ç—å)
10. **Lowest Router ID**

---

### –ü—Ä–∏–º–µ—Ä: –í–ª–∏—è–Ω–∏–µ –Ω–∞ Path Selection

**–¢–µ–∫—É—â–∞—è —Å–∏—Ç—É–∞—Ü–∏—è:**
- ISP A –∏ ISP B –∞–Ω–æ–Ω—Å–∏—Ä—É—é—Ç 0.0.0.0/0
- BGP –≤—ã–±–∏—Ä–∞–µ—Ç ISP A (–ø–æ—á–µ–º—É?)

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
R1# show ip bgp 0.0.0.0
```

**–í—ã–≤–æ–¥ –ø–æ–∫–∞–∂–µ—Ç:**
```
  Path: 65100
  Path: 65200
```

–û–±–∞ –ø—É—Ç–∏ –æ–¥–∏–Ω–∞–∫–æ–≤—ã–µ –ø–æ AS-PATH length (1 AS).

**BGP –≤—ã–±—Ä–∞–ª ISP A –ø–æ—Ç–æ–º—É —á—Ç–æ:**
- Oldest route (ISP A neighbor —É—Å—Ç–∞–Ω–æ–≤–∏–ª—Å—è –ø–µ—Ä–≤—ã–º)
- –ò–ª–∏ Lower Router ID

---

### –í–ª–∏—è–Ω–∏–µ –Ω–∞ –≤—ã–±–æ—Ä —Å –ø–æ–º–æ—â—å—é Weight

**–ü—Ä–µ–¥–ø–æ—á–µ—Å—Ç—å ISP B:**
```cisco
R1(config)# router bgp 65001
R1(config-router)# neighbor 203.0.113.5 weight 200
R1(config-router)# end
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
R1# show ip bgp
```

–¢–µ–ø–µ—Ä—å best path —á–µ—Ä–µ–∑ ISP B (–±–æ–ª—å—à–∏–π Weight).

**–í–µ—Ä–Ω—É—Ç—å –æ–±—Ä–∞—Ç–Ω–æ:**
```cisco
R1(config)# router bgp 65001
R1(config-router)# no neighbor 203.0.113.5 weight 200
```

---

## üìù –ß–ê–°–¢–¨ 8: BGP Route Filtering

### –®–ê–ì 6: Prefix-List –¥–ª—è —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏–∏

**–ó–∞–¥–∞—á–∞:** –†–∞–∑—Ä–µ—à–∏—Ç—å —Ç–æ–ª—å–∫–æ default route –æ—Ç ISP, –±–ª–æ–∫–∏—Ä–æ–≤–∞—Ç—å –æ—Å—Ç–∞–ª—å–Ω–æ–µ.

**–°–æ–∑–¥–∞–Ω–∏–µ Prefix-List:**
```cisco
R1(config)# ip prefix-list ALLOW-DEFAULT permit 0.0.0.0/0
R1(config)# ip prefix-list ALLOW-DEFAULT deny 0.0.0.0/0 le 32
```

**–ü—Ä–∏–º–µ–Ω–µ–Ω–∏–µ –∫ neighbor:**
```cisco
R1(config)# router bgp 65001
R1(config-router)# neighbor 203.0.113.1 prefix-list ALLOW-DEFAULT in
R1(config-router)# neighbor 203.0.113.5 prefix-list ALLOW-DEFAULT in
R1(config-router)# exit
```

**Clear BGP –¥–ª—è –ø—Ä–∏–º–µ–Ω–µ–Ω–∏—è:**
```cisco
R1# clear ip bgp * soft in
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `prefix-list` - –±–æ–ª–µ–µ –≥–∏–±–∫–∏–π —á–µ–º ACL –¥–ª—è BGP
- `permit 0.0.0.0/0` - —Ä–∞–∑—Ä–µ—à–∏—Ç—å —Ç–æ—á–Ω–æ default route
- `deny 0.0.0.0/0 le 32` - –∑–∞–ø—Ä–µ—Ç–∏—Ç—å –≤—Å—ë –æ—Å—Ç–∞–ª—å–Ω–æ–µ
- `in` - –≤—Ö–æ–¥—è—â–∏–µ updates –æ—Ç neighbor

---

### –ò—Å—Ö–æ–¥—è—â–∞—è —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏—è (Outbound)

**–ó–∞–¥–∞—á–∞:** –ê–Ω–æ–Ω—Å–∏—Ä–æ–≤–∞—Ç—å —Ç–æ–ª—å–∫–æ –∞–≥—Ä–µ–≥–∏—Ä–æ–≤–∞–Ω–Ω—ã–π 10.0.0.0/8 prefix.

```cisco
R1(config)# ip prefix-list ADVERTISE-AGGREGATE permit 10.0.0.0/8
R1(config)# ip prefix-list ADVERTISE-AGGREGATE deny 0.0.0.0/0 le 32

R1(config)# router bgp 65001
R1(config-router)# neighbor 203.0.113.1 prefix-list ADVERTISE-AGGREGATE out
R1(config-router)# neighbor 203.0.113.5 prefix-list ADVERTISE-AGGREGATE out
R1(config-router)# exit
```

**Clear BGP:**
```cisco
R1# clear ip bgp * soft out
```

–¢–µ–ø–µ—Ä—å ISP –ø–æ–ª—É—á–∞—é—Ç —Ç–æ–ª—å–∫–æ 10.0.0.0/8, –Ω–µ –¥–µ—Ç–∞–ª—å–Ω—ã–µ subnets.

---

## üìù –ß–ê–°–¢–¨ 9: BGP Attributes Manipulation

### –ò—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ AS-PATH Prepending

**–ó–∞–¥–∞—á–∞:** –°–¥–µ–ª–∞—Ç—å –ø—É—Ç—å —á–µ—Ä–µ–∑ ISP B –º–µ–Ω–µ–µ –ø—Ä–µ–¥–ø–æ—á—Ç–∏—Ç–µ–ª—å–Ω—ã–º.

**AS-PATH Prepending:**
```cisco
R1(config)# route-map PREPEND-AS permit 10
R1(config-route-map)# set as-path prepend 65001 65001 65001
R1(config-route-map)# exit

R1(config)# router bgp 65001
R1(config-router)# neighbor 203.0.113.5 route-map PREPEND-AS out
R1(config-router)# exit
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `set as-path prepend` - –¥–æ–±–∞–≤–ª—è–µ—Ç –Ω–∞—à ASN –Ω–µ—Å–∫–æ–ª—å–∫–æ —Ä–∞–∑
- –î–µ–ª–∞–µ—Ç AS-PATH –¥–ª–∏–Ω–Ω–µ–µ
- –î—Ä—É–≥–∏–µ AS –≤—ã–±–µ—Ä—É—Ç –±–æ–ª–µ–µ –∫–æ—Ä–æ—Ç–∫–∏–π –ø—É—Ç—å (—á–µ—Ä–µ–∑ ISP A)

**–ò—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è –¥–ª—è:** Traffic engineering (–∫–æ–Ω—Ç—Ä–æ–ª—å –≤—Ö–æ–¥—è—â–µ–≥–æ —Ç—Ä–∞—Ñ–∏–∫–∞)

---

### –ò—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ Local Preference (iBGP)

üí° –ï—Å–ª–∏ –±—ã —É –Ω–∞—Å –±—ã–ª–æ iBGP (–Ω–µ—Å–∫–æ–ª—å–∫–æ —Ä–æ—É—Ç–µ—Ä–æ–≤ –≤ AS 65001):

```cisco
R1(config)# route-map PREFER-ISP-A permit 10
R1(config-route-map)# set local-preference 200
R1(config-route-map)# exit

R1(config)# router bgp 65001
R1(config-router)# neighbor 203.0.113.1 route-map PREFER-ISP-A in
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- Local Preference - –≤–Ω—É—Ç—Ä–∏ AS
- –ë–æ–ª—å—à–µ = –ª—É—á—à–µ (default: 100)
- –í—Å–µ —Ä–æ—É—Ç–µ—Ä—ã –≤ AS –ø—Ä–µ–¥–ø–æ—á—Ç—É—Ç —ç—Ç–æ—Ç –ø—É—Ç—å

---

## üìù –ß–ê–°–¢–¨ 10: BGP Failover Testing

### –®–ê–ì 7: –¢–µ—Å—Ç–∏—Ä–æ–≤–∞–Ω–∏–µ –æ—Ç–∫–∞–∑–æ—É—Å—Ç–æ–π—á–∏–≤–æ—Å—Ç–∏

**–¢–µ—Å—Ç 1: –û—Ç–∫–ª—é—á–µ–Ω–∏–µ primary link**

```cisco
R1(config)# interface g0/0/0
R1(config-if)# shutdown
R1(config-if)# exit
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
R1# show ip bgp summary
```

ISP A neighbor –¥–æ–ª–∂–µ–Ω –±—ã—Ç—å –≤ —Å–æ—Å—Ç–æ—è–Ω–∏–∏ Idle.

```cisco
R1# show ip route
```

Default route —Ç–µ–ø–µ—Ä—å —á–µ—Ä–µ–∑ ISP B (203.0.113.5).

**–¢–µ—Å—Ç connectivity —Å PC1:**
```
PC> ping 8.8.8.8
```

Ping –¥–æ–ª–∂–µ–Ω —Ä–∞–±–æ—Ç–∞—Ç—å —á–µ—Ä–µ–∑ backup link!

---

**–í–æ—Å—Å—Ç–∞–Ω–æ–≤–ª–µ–Ω–∏–µ:**
```cisco
R1(config)# interface g0/0/0
R1(config-if)# no shutdown
R1(config-if)# exit
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
R1# show ip bgp summary
```

–û–±–∞ neighbors —Å–Ω–æ–≤–∞ Established.

---

### –¢–µ—Å—Ç 2: BGP Graceful Restart

**–ü–µ—Ä–µ–∑–∞–ø—É—Å–∫ BGP –ø—Ä–æ—Ü–µ—Å—Å–∞:**
```cisco
R1# clear ip bgp *
```

‚è≥ BGP neighbors –ø–µ—Ä–µ—É—Å—Ç–∞–Ω–æ–≤—è—Ç—Å—è (~30 —Å–µ–∫—É–Ω–¥).

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
R1# show ip bgp summary
```

–û–±–∞ neighbors –¥–æ–ª–∂–Ω—ã –≤–µ—Ä–Ω—É—Ç—å—Å—è –≤ Established.

---

## ‚úÖ –ü—Ä–æ–≤–µ—Ä–∫–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏ BGP

### 1. BGP Process

```cisco
R1# show ip protocols
```

–î–æ–ª–∂–Ω—ã –≤–∏–¥–µ—Ç—å BGP process —Å ASN 65001.

---

### 2. BGP Neighbors

```cisco
R1# show ip bgp summary

Neighbor        V    AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
203.0.113.1     4 65100      XX      XX       XX    0    0 hh:mm:ss        1
203.0.113.5     4 65200      XX      XX       XX    0    0 hh:mm:ss        1
```

‚úÖ –û–±–∞ neighbors –≤ —Å–æ—Å—Ç–æ—è–Ω–∏–∏ —Å —Ü–∏—Ñ—Ä–æ–π (–ø–æ–ª—É—á–µ–Ω—ã prefixes).

---

### 3. BGP Table

```cisco
R1# show ip bgp
```

–î–æ–ª–∂–Ω—ã –≤–∏–¥–µ—Ç—å:
- Default route (0.0.0.0/0) –æ—Ç –æ–±–æ–∏—Ö ISP
- Best path –≤—ã–±—Ä–∞–Ω (—Å–∏–º–≤–æ–ª `>`)
- –õ–æ–∫–∞–ª—å–Ω–∞—è —Å–µ—Ç—å 10.0.0.0/8

---

### 4. IP Routing Table

```cisco
R1# show ip route bgp
```

Default route –¥–æ–ª–∂–µ–Ω –±—ã—Ç—å —É—Å—Ç–∞–Ω–æ–≤–ª–µ–Ω —á–µ—Ä–µ–∑ BGP.

---

### 5. BGP Advertised Routes

```cisco
R1# show ip bgp neighbors 203.0.113.1 advertised-routes
```

–î–æ–ª–∂–Ω—ã –≤–∏–¥–µ—Ç—å 10.0.0.0/8 –∞–Ω–æ–Ω—Å–∏—Ä—É–µ–º—ã–π –∫ ISP A.

---

### 6. BGP Received Routes

```cisco
R1# show ip bgp neighbors 203.0.113.1 received-routes
```

–î–æ–ª–∂–Ω—ã –≤–∏–¥–µ—Ç—å default route –æ—Ç ISP A.

üí° **–ü—Ä–∏–º–µ—á–∞–Ω–∏–µ:** –≠—Ç–∞ –∫–æ–º–∞–Ω–¥–∞ —Ç—Ä–µ–±—É–µ—Ç `neighbor soft-reconfiguration inbound`.

---

## üìä BGP Configuration Summary

### R1 BGP Configuration

```cisco
router bgp 65001
 bgp router-id 10.0.0.76
 bgp log-neighbor-changes
 neighbor 203.0.113.1 remote-as 65100
 neighbor 203.0.113.1 description ISP-A
 neighbor 203.0.113.5 remote-as 65200
 neighbor 203.0.113.5 description ISP-B
 network 10.0.0.0 mask 255.0.0.0
```

---

### BGP Neighbors Summary

| Neighbor | Remote AS | Description | Type | Status |
|----------|-----------|-------------|------|--------|
| 203.0.113.1 | 65100 | ISP-A | eBGP | Established |
| 203.0.113.5 | 65200 | ISP-B | eBGP | Established |

---

### BGP Routes Summary

| Network | Next-Hop | AS-PATH | Best | Source |
|---------|----------|---------|------|--------|
| 0.0.0.0/0 | 203.0.113.1 | 65100 | ‚úÖ | ISP A |
| 0.0.0.0/0 | 203.0.113.5 | 65200 | ‚ùå | ISP B |
| 10.0.0.0/8 | 0.0.0.0 | - | ‚úÖ | Local |

---

## üéì –ö–ª—é—á–µ–≤—ã–µ –∫–æ–º–∞–Ω–¥—ã BGP

```cisco
# BGP Process
router bgp [asn]
 bgp router-id [ip]
 bgp log-neighbor-changes
 neighbor [ip] remote-as [asn]
 neighbor [ip] description [text]
 neighbor [ip] weight [value]
 network [network] mask [mask]

# Route Manipulation
neighbor [ip] route-map [name] in|out
neighbor [ip] prefix-list [name] in|out
set as-path prepend [asn] [asn]...
set local-preference [value]

# Verification
show ip bgp
show ip bgp summary
show ip bgp neighbors
show ip bgp neighbors [ip] advertised-routes
show ip bgp neighbors [ip] received-routes
show ip protocols
clear ip bgp *
clear ip bgp * soft in|out

# Filtering
ip prefix-list [name] permit|deny [prefix]
route-map [name] permit|deny [seq]
```

---

## üí° BGP Best Practices

### Design:
1. ‚úÖ –í—Å–µ–≥–¥–∞ –∏—Å–ø–æ–ª—å–∑—É–π—Ç–µ Router ID –≤—Ä—É—á–Ω—É—é
2. ‚úÖ –î–æ–∫—É–º–µ–Ω—Ç–∏—Ä—É–π—Ç–µ neighbors (description)
3. ‚úÖ –ò—Å–ø–æ–ª—å–∑—É–π—Ç–µ prefix-lists –¥–ª—è —Ñ–∏–ª—å—Ç—Ä–∞—Ü–∏–∏
4. ‚úÖ –õ–æ–≥–∏—Ä—É–π—Ç–µ –∏–∑–º–µ–Ω–µ–Ω–∏—è neighbors
5. ‚úÖ –ü–ª–∞–Ω–∏—Ä—É–π—Ç–µ AS numbering (private vs public)

### Security:
1. ‚úÖ MD5 authentication –º–µ–∂–¥—É peers
2. ‚úÖ Maximum-prefix limits
3. ‚úÖ Strict prefix filtering (in –∏ out)
4. ‚úÖ –ù–µ –ø—Ä–∏–Ω–∏–º–∞–π—Ç–µ full routing table (default only)
5. ‚úÖ TTL security (eBGP multihop protection)

### Operations:
1. ‚úÖ –ú–æ–Ω–∏—Ç–æ—Ä—å—Ç–µ BGP sessions (state changes)
2. ‚úÖ –ò—Å–ø–æ–ª—å–∑—É–π—Ç–µ soft reconfiguration (soft reset)
3. ‚úÖ –î–æ–∫—É–º–µ–Ω—Ç–∏—Ä—É–π—Ç–µ route-maps –∏ policy
4. ‚úÖ –¢–µ—Å—Ç–∏—Ä—É–π—Ç–µ failover —Ä–µ–≥—É–ª—è—Ä–Ω–æ
5. ‚úÖ –°–ª–µ–¥–∏—Ç–µ –∑–∞ routing table size

---

## üîç Troubleshooting BGP

### –ü—Ä–æ–±–ª–µ–º–∞ 1: Neighbor –Ω–µ —É—Å—Ç–∞–Ω–∞–≤–ª–∏–≤–∞–µ—Ç—Å—è

**–°–∏–º–ø—Ç–æ–º—ã:**
```cisco
R1# show ip bgp summary
Neighbor in Idle or Active state
```

**–ü—Ä–∏—á–∏–Ω—ã –∏ —Ä–µ—à–µ–Ω–∏—è:**

1. **–ù–µ—Ç IP connectivity**
```cisco
R1# ping 203.0.113.1
! –î–æ–ª–∂–µ–Ω —Ä–∞–±–æ—Ç–∞—Ç—å
```

2. **–ù–µ–ø—Ä–∞–≤–∏–ª—å–Ω—ã–π remote-as**
```cisco
show ip bgp neighbors 203.0.113.1
! –ü—Ä–æ–≤–µ—Ä—å—Ç–µ configured vs expected AS
```

3. **TCP port 179 blocked**
```cisco
show ip access-lists
! –ü—Ä–æ–≤–µ—Ä—å—Ç–µ ACL –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞—Ö
```

4. **–ù–µ–ø—Ä–∞–≤–∏–ª—å–Ω—ã–π neighbor IP**
```cisco
router bgp 65001
 no neighbor 203.0.113.1
 neighbor 203.0.113.1 remote-as 65100
```

---

### –ü—Ä–æ–±–ª–µ–º–∞ 2: Routes –Ω–µ –ø–æ—è–≤–ª—è—é—Ç—Å—è

**–°–∏–º–ø—Ç–æ–º—ã:** Neighbor Established, –Ω–æ –Ω–µ—Ç routes

**–ü—Ä–∏—á–∏–Ω—ã:**

1. **Network –Ω–µ –≤ routing table**
```cisco
R1# show ip route 10.0.0.0
! –°–µ—Ç—å –¥–æ–ª–∂–Ω–∞ —Å—É—â–µ—Å—Ç–≤–æ–≤–∞—Ç—å
```

2. **Prefix-list –±–ª–æ–∫–∏—Ä—É–µ—Ç**
```cisco
R1# show ip bgp neighbors 203.0.113.1 | include filter
```

3. **Route-map –±–ª–æ–∫–∏—Ä—É–µ—Ç**
```cisco
show route-map
```

---

### –ü—Ä–æ–±–ª–µ–º–∞ 3: –ù–µ–ø—Ä–∞–≤–∏–ª—å–Ω—ã–π best path

**–°–∏–º–ø—Ç–æ–º—ã:** BGP –≤—ã–±–∏—Ä–∞–µ—Ç –Ω–µ —Ç–æ—Ç –ø—É—Ç—å

**–†–µ—à–µ–Ω–∏–µ:** –ü—Ä–æ–≤–µ—Ä—å—Ç–µ path selection algorithm

```cisco
R1# show ip bgp [network]
```

–°–º–æ—Ç—Ä–∏—Ç–µ:
- Weight (–≤—ã—à–µ = –ª—É—á—à–µ)
- Local Preference (–≤—ã—à–µ = –ª—É—á—à–µ)
- AS-PATH (–∫–æ—Ä–æ—á–µ = –ª—É—á—à–µ)
- Origin
- MED
- eBGP vs iBGP

–ò—Å–ø–æ–ª—å–∑—É–π—Ç–µ route-map –¥–ª—è –∏–∑–º–µ–Ω–µ–Ω–∏—è attributes.

---

## üìö BGP –¥–ª—è —Ä–µ–∞–ª—å–Ω–æ–≥–æ –º–∏—Ä–∞

### –ö–æ–≥–¥–∞ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å BGP?

**‚úÖ –ò—Å–ø–æ–ª—å–∑—É–π—Ç–µ BGP:**
- Multihoming –∫ 2+ ISP
- –í—ã —è–≤–ª—è–µ—Ç–µ—Å—å ISP –∏–ª–∏ Service Provider
- –ö—Ä—É–ø–Ω–∞—è Enterprise —Å–µ—Ç—å (multiple sites)
- –ù—É–∂–µ–Ω –¥–µ—Ç–∞–ª—å–Ω—ã–π –∫–æ–Ω—Ç—Ä–æ–ª—å routing policy
- –ò–Ω—Ç–µ–≥—Ä–∞—Ü–∏—è —Å Cloud providers

**‚ùå –ù–ï –∏—Å–ø–æ–ª—å–∑—É–π—Ç–µ BGP:**
- –û–¥–∏–Ω ISP (–∏—Å–ø–æ–ª—å–∑—É–π—Ç–µ default route + NAT)
- –ú–∞–ª—ã–π/—Å—Ä–µ–¥–Ω–∏–π –±–∏–∑–Ω–µ—Å –±–µ–∑ multihoming
- –ù–µ—Ç –æ–ø—ã—Ç–∞ –∞–¥–º–∏–Ω–∏—Å—Ç—Ä–∏—Ä–æ–≤–∞–Ω–∏—è BGP
- –ù–µ—Ç –Ω–µ–æ–±—Ö–æ–¥–∏–º–æ—Å—Ç–∏ –≤ —Å–ª–æ–∂–Ω–æ–π routing policy

---

### BGP –≤ Cloud (AWS, Azure, GCP)

**AWS:**
- Virtual Private Gateway (VGW) —Å BGP
- AWS ASN: 64512-65534 –∏–ª–∏ custom
- BGP –¥–ª—è Direct Connect, VPN

**Azure:**
- VPN Gateway —Å BGP
- Azure ASN: 65515 (default)
- ExpressRoute —Å BGP

**GCP:**
- Cloud Router —Å BGP
- Google ASN: 16550
- Cloud Interconnect —Å BGP

üí° –ó–Ω–∞–Ω–∏–µ BGP –∫—Ä–∏—Ç–∏—á–µ—Å–∫–∏ –≤–∞–∂–Ω–æ –¥–ª—è Cloud networking!

---

## üéØ –ß–µ–∫-–ª–∏—Å—Ç –∑–∞–≤–µ—Ä—à–µ–Ω–∏—è Bonus Part 10

### BGP Configuration:
- [ ] Static routes —É–¥–∞–ª–µ–Ω—ã –Ω–∞ R1
- [ ] BGP process —Å–æ–∑–¥–∞–Ω (AS 65001)
- [ ] Router ID –Ω–∞—Å—Ç—Ä–æ–µ–Ω (10.0.0.76)
- [ ] Neighbor –∫ ISP A –Ω–∞—Å—Ç—Ä–æ–µ–Ω (203.0.113.1, AS 65100)
- [ ] Neighbor –∫ ISP B –Ω–∞—Å—Ç—Ä–æ–µ–Ω (203.0.113.5, AS 65200)
- [ ] Network 10.0.0.0/8 –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç—Å—è

### BGP Verification:
- [ ] Show ip bgp summary - –æ–±–∞ neighbors Established
- [ ] Show ip bgp - default route –ø–æ–ª—É—á–µ–Ω
- [ ] Show ip route bgp - default route –≤ routing table
- [ ] Ping 8.8.8.8 —Ä–∞–±–æ—Ç–∞–µ—Ç —Å –≤–Ω—É—Ç—Ä–µ–Ω–Ω–∏—Ö —É—Å—Ç—Ä–æ–π—Å—Ç–≤

### Advance
