# CCNA –ú–∏–Ω–∏-–∫—É—Ä—Å –Ω–∞ –æ—Å–Ω–æ–≤–µ Jeremy's Mega Lab
## –ß–∞—Å—Ç—å 5: OSPF Dynamic Routing & Static Routes

---

## üìã –¢–µ–æ—Ä–µ—Ç–∏—á–µ—Å–∫–∏–π –º–∏–Ω–∏–º—É–º

### –ö–ª—é—á–µ–≤—ã–µ –∫–æ–Ω—Ü–µ–ø—Ü–∏–∏:

**1. OSPF (Open Shortest Path First)**
- Link-state –ø—Ä–æ—Ç–æ–∫–æ–ª –º–∞—Ä—à—Ä—É—Ç–∏–∑–∞—Ü–∏–∏
- –°—Ç–∞–Ω–¥–∞—Ä—Ç IEEE (–æ—Ç–∫—Ä—ã—Ç—ã–π –ø—Ä–æ—Ç–æ–∫–æ–ª)
- –ò—Å–ø–æ–ª—å–∑—É–µ—Ç –∞–ª–≥–æ—Ä–∏—Ç–º Dijkstra (SPF)
- –ú–µ—Ç—Ä–∏–∫–∞: cost (–æ—Å–Ω–æ–≤–∞–Ω –Ω–∞ bandwidth)
- AD (Administrative Distance): 110

**2. OSPF Areas**
- –õ–æ–≥–∏—á–µ—Å–∫–æ–µ —Ä–∞–∑–¥–µ–ª–µ–Ω–∏–µ —Å–µ—Ç–∏ OSPF
- **Area 0** - backbone area (–æ–±—è–∑–∞—Ç–µ–ª—å–Ω–∞)
- –í—Å–µ –æ—Å—Ç–∞–ª—å–Ω—ã–µ area –ø–æ–¥–∫–ª—é—á–∞—é—Ç—Å—è –∫ Area 0
- –í –Ω–∞—à–µ–π –ª–∞–±–µ: —Ç–æ–ª—å–∫–æ Area 0

**3. OSPF Process ID**
- –õ–æ–∫–∞–ª—å–Ω–æ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –Ω–∞ —Ä–æ—É—Ç–µ—Ä–µ
- –ù–µ –æ–±—è–∑–∞—Ç–µ–ª—å–Ω–æ —Å–æ–≤–ø–∞–¥–∞—Ç—å –º–µ–∂–¥—É —Ä–æ—É—Ç–µ—Ä–∞–º–∏
- –í –ª–∞–±–µ –∏—Å–ø–æ–ª—å–∑—É–µ–º: Process ID = 1

**4. OSPF Router ID**
- –£–Ω–∏–∫–∞–ª—å–Ω—ã–π –∏–¥–µ–Ω—Ç–∏—Ñ–∏–∫–∞—Ç–æ—Ä —Ä–æ—É—Ç–µ—Ä–∞ –≤ OSPF –¥–æ–º–µ–Ω–µ
- –§–æ—Ä–º–∞—Ç: –∫–∞–∫ IP –∞–¥—Ä–µ—Å (–Ω–∞–ø—Ä–∏–º–µ—Ä, 10.0.0.76)
- –í—ã–±–æ—Ä: Manual > Highest Loopback > Highest Physical IP

**5. OSPF Network Statement**
- –í–∫–ª—é—á–∞–µ—Ç –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å—ã –≤ OSPF –ø—Ä–æ—Ü–µ—Å—Å
- –§–æ—Ä–º–∞—Ç: `network [ip] [wildcard-mask] area [area-id]`
- Wildcard mask: –∏–Ω–≤–µ—Ä—Å–∏—è subnet mask

**6. OSPF Interface Configuration**
- –ê–ª—å—Ç–µ—Ä–Ω–∞—Ç–∏–≤–∞ network statement
- `ip ospf [process-id] area [area-id]` –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–µ
- –ë–æ–ª–µ–µ –≥—Ä–∞–Ω—É–ª—è—Ä–Ω—ã–π –∫–æ–Ω—Ç—Ä–æ–ª—å

**7. OSPF Passive Interface**
- –ò–Ω—Ç–µ—Ä—Ñ–µ–π—Å –Ω–µ –æ—Ç–ø—Ä–∞–≤–ª—è–µ—Ç Hello –ø–∞–∫–µ—Ç—ã
- –ù–æ —Å–µ—Ç—å –≤—Å—ë —Ä–∞–≤–Ω–æ –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç—Å—è
- –ò—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è –Ω–∞ LAN –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞—Ö –±–µ–∑ OSPF —Å–æ—Å–µ–¥–µ–π

**8. OSPF Network Type**
- **Broadcast** - –≤—ã–±–∏—Ä–∞–µ—Ç DR/BDR (–ø–æ —É–º–æ–ª—á–∞–Ω–∏—é –Ω–∞ Ethernet)
- **Point-to-Point** - –Ω–µ –≤—ã–±–∏—Ä–∞–µ—Ç DR/BDR (—Ä–µ–∫–æ–º–µ–Ω–¥—É–µ—Ç—Å—è)
- –í –ª–∞–±–µ: Point-to-Point –Ω–∞ –≤—Å–µ—Ö p2p –ª–∏–Ω–∫–∞—Ö

**9. ASBR (Autonomous System Boundary Router)**
- –†–æ—É—Ç–µ—Ä –Ω–∞ –≥—Ä–∞–Ω–∏—Ü–µ OSPF –¥–æ–º–µ–Ω–∞
- –ê–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç –≤–Ω–µ—à–Ω–∏–µ –º–∞—Ä—à—Ä—É—Ç—ã
- R1 –≤ –Ω–∞—à–µ–π –ª–∞–±–µ - ASBR

**10. Default Route**
- 0.0.0.0/0 - –º–∞—Ä—à—Ä—É—Ç "–ø–æ —É–º–æ–ª—á–∞–Ω–∏—é"
- –ò—Å–ø–æ–ª—å–∑—É–µ—Ç—Å—è –∫–æ–≥–¥–∞ –Ω–µ—Ç –±–æ–ª–µ–µ —Å–ø–µ—Ü–∏—Ñ–∏—á–Ω–æ–≥–æ –º–∞—Ä—à—Ä—É—Ç–∞
- –í –ª–∞–±–µ: R1 –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç default route –≤ OSPF

---

## üéØ –¶–µ–ª–∏ —Ä–∞–∑–¥–µ–ª–∞

- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å OSPF –Ω–∞ R1 (LAN-facing interfaces)
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å OSPF –Ω–∞ Core switches (CSW1, CSW2)
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å OSPF –Ω–∞ Distribution switches
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å Router ID –≤—Ä—É—á–Ω—É—é
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å Passive interfaces
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å Point-to-Point network type
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å Static Default Routes –Ω–∞ R1
- ‚úÖ –ù–∞—Å—Ç—Ä–æ–∏—Ç—å R1 –∫–∞–∫ ASBR

---

## üó∫Ô∏è OSPF Design

### OSPF Parameters:
- **Process ID**: 1
- **Area**: 0 (backbone)
- **Router IDs**: Match loopback IP addresses

### Network Types:
- All point-to-point links: `ip ospf network point-to-point`
- CSW1 ‚Üî CSW2 PortChannel: default (broadcast) - –∫–æ–º–∞–Ω–¥–∞ –Ω–µ–¥–æ—Å—Ç—É–ø–Ω–∞ –≤ PT

### Passive Interfaces:
- –í—Å–µ loopback –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å—ã
- Distribution switches: SVIs (–∫—Ä–æ–º–µ VLAN 99)

---

## üìù –ß–ê–°–¢–¨ 1: OSPF on R1

### –®–ê–ì 1: –ë–∞–∑–æ–≤–∞—è –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è OSPF –Ω–∞ R1

**R1 Interfaces –¥–ª—è OSPF:**
- G0/0 ‚Üí CSW1 (10.0.0.33/30)
- G0/1 ‚Üí CSW2 (10.0.0.37/30)
- Lo0 ‚Üí Loopback (10.0.0.76/32)

```cisco
R1(config)# router ospf 1
R1(config-router)# router-id 10.0.0.76
R1(config-router)# passive-interface loopback 0
R1(config-router)# exit
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `router ospf 1` - —Å–æ–∑–¥–∞—ë—Ç OSPF –ø—Ä–æ—Ü–µ—Å—Å 1
- `router-id 10.0.0.76` - –≤—Ä—É—á–Ω—É—é –∑–∞–¥–∞—ë–º Router ID
- `passive-interface loopback 0` - loopback –Ω–µ –æ—Ç–ø—Ä–∞–≤–ª—è–µ—Ç Hello

---

### –ê–∫—Ç–∏–≤–∞—Ü–∏—è OSPF –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞—Ö R1

**–ú–µ—Ç–æ–¥: Interface Configuration Mode**

```cisco
R1(config)# interface loopback 0
R1(config-if)# ip ospf 1 area 0
R1(config-if)# exit

R1(config)# interface range g0/0-1
R1(config-if-range)# ip ospf 1 area 0
R1(config-if-range)# ip ospf network point-to-point
R1(config-if-range)# exit
R1(config)# do write
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `ip ospf 1 area 0` - –≤–∫–ª—é—á–∞–µ—Ç OSPF –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–µ
- `ip ospf network point-to-point` - –º–µ–Ω—è–µ—Ç —Ç–∏–ø —Å–µ—Ç–∏

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
R1# show ip ospf interface brief
R1# show ip ospf neighbor
```

---

## üìù –ß–ê–°–¢–¨ 2: OSPF on Core Switches

### –®–ê–ì 1: CSW1 Configuration

**CSW1 Interfaces –¥–ª—è OSPF:**
- G1/0/1 ‚Üí R1
- G1/1/1 ‚Üí DSW-A1
- G1/1/2 ‚Üí DSW-A2
- G1/1/3 ‚Üí DSW-B1
- G1/1/4 ‚Üí DSW-B2
- Po1 ‚Üí CSW2
- Lo0 ‚Üí Loopback

```cisco
CSW1(config)# router ospf 1
CSW1(config-router)# router-id 10.0.0.77
CSW1(config-router)# passive-interface loopback 0
CSW1(config-router)# network 10.0.0.41 0.0.0.0 area 0
CSW1(config-router)# network 10.0.0.34 0.0.0.0 area 0
CSW1(config-router)# network 10.0.0.45 0.0.0.0 area 0
CSW1(config-router)# network 10.0.0.49 0.0.0.0 area 0
CSW1(config-router)# network 10.0.0.53 0.0.0.0 area 0
CSW1(config-router)# network 10.0.0.57 0.0.0.0 area 0
CSW1(config-router)# network 10.0.0.77 0.0.0.0 area 0
CSW1(config-router)# exit
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `network [ip] 0.0.0.0 area 0` - /32 wildcard mask (—Ç–æ—á–Ω—ã–π IP)
- –í–∫–ª—é—á–∞–µ—Ç –≤—Å–µ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å—ã —Å —ç—Ç–∏–º IP –≤ OSPF

---

### –ù–∞—Å—Ç—Ä–æ–π–∫–∞ Point-to-Point –Ω–∞ —Ñ–∏–∑–∏—á–µ—Å–∫–∏—Ö –ø–æ—Ä—Ç–∞—Ö CSW1

```cisco
CSW1(config)# interface range g1/0/1, g1/1/1-4
CSW1(config-if-range)# ip ospf network point-to-point
CSW1(config-if-range)# exit
CSW1(config)# do write
```

üí° **–í–∞–∂–Ω–æ:** –ù–∞ PortChannel1 –∫–æ–º–∞–Ω–¥–∞ `ip ospf network point-to-point` –Ω–µ–¥–æ—Å—Ç—É–ø–Ω–∞ –≤ Packet Tracer - –æ—Å—Ç–∞–≤–ª—è–µ–º default (broadcast).

---

### –®–ê–ì 1 (–ø—Ä–æ–¥–æ–ª–∂–µ–Ω–∏–µ): CSW2 Configuration

```cisco
CSW2(config)# router ospf 1
CSW2(config-router)# router-id 10.0.0.78
CSW2(config-router)# passive-interface loopback 0
CSW2(config-router)# network 10.0.0.42 0.0.0.0 area 0
CSW2(config-router)# network 10.0.0.38 0.0.0.0 area 0
CSW2(config-router)# network 10.0.0.61 0.0.0.0 area 0
CSW2(config-router)# network 10.0.0.65 0.0.0.0 area 0
CSW2(config-router)# network 10.0.0.69 0.0.0.0 area 0
CSW2(config-router)# network 10.0.0.73 0.0.0.0 area 0
CSW2(config-router)# network 10.0.0.78 0.0.0.0 area 0
CSW2(config-router)# exit

CSW2(config)# interface range g1/0/1, g1/1/1-4
CSW2(config-if-range)# ip ospf network point-to-point
CSW2(config-if-range)# exit
CSW2(config)# do write
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞ —Å–æ—Å–µ–¥—Å—Ç–≤–∞:**
```cisco
CSW2# show ip ospf neighbor
```

–î–æ–ª–∂–Ω—ã –≤–∏–¥–µ—Ç—å: R1, CSW1, DSW-A1, DSW-A2, DSW-B1, DSW-B2

---

## üìù –ß–ê–°–¢–¨ 3: OSPF on Distribution Switches

### –®–ê–ì 1: DSW-A1 Configuration

**–ò–Ω—Ç–µ—Ä—Ñ–µ–π—Å—ã DSW-A1:**
- G1/1/1 ‚Üí CSW1
- G1/1/2 ‚Üí CSW2
- VLAN 10, 20, 40, 99 (SVIs)
- Lo0 ‚Üí Loopback

**Passive Interfaces:**
- Loopback 0
- VLAN 10, 20, 40 (–Ω–µ VLAN 99 - —Å–æ—Å–µ–¥—Å—Ç–≤–æ —Å DSW-A2)

```cisco
DSW-A1(config)# router ospf 1
DSW-A1(config-router)# router-id 10.0.0.79
DSW-A1(config-router)# passive-interface loopback 0
DSW-A1(config-router)# passive-interface vlan 10
DSW-A1(config-router)# passive-interface vlan 20
DSW-A1(config-router)# passive-interface vlan 40
DSW-A1(config-router)# network 10.0.0.46 0.0.0.0 area 0
DSW-A1(config-router)# network 10.0.0.62 0.0.0.0 area 0
DSW-A1(config-router)# network 10.0.0.2 0.0.0.0 area 0
DSW-A1(config-router)# network 10.1.0.2 0.0.0.0 area 0
DSW-A1(config-router)# network 10.2.0.2 0.0.0.0 area 0
DSW-A1(config-router)# network 10.6.0.2 0.0.0.0 area 0
DSW-A1(config-router)# network 10.0.0.79 0.0.0.0 area 0
DSW-A1(config-router)# exit

DSW-A1(config)# interface range g1/1/1-2
DSW-A1(config-if-range)# ip ospf network point-to-point
DSW-A1(config-if-range)# exit
DSW-A1(config)# do write
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ Passive Interfaces:**
- VLAN 99: Active - —Å–æ—Å–µ–¥—Å—Ç–≤–æ —Å DSW-A2 —á–µ—Ä–µ–∑ —ç—Ç–æ—Ç VLAN
- VLAN 10, 20, 40: Passive - –Ω–µ—Ç –¥—Ä—É–≥–∏—Ö OSPF —Ä–æ—É—Ç–µ—Ä–æ–≤

---

### –®–ê–ì 1 (–ø—Ä–æ–¥–æ–ª–∂–µ–Ω–∏–µ): DSW-A2 Configuration

```cisco
DSW-A2(config)# router ospf 1
DSW-A2(config-router)# router-id 10.0.0.80
DSW-A2(config-router)# passive-interface loopback 0
DSW-A2(config-router)# passive-interface vlan 10
DSW-A2(config-router)# passive-interface vlan 20
DSW-A2(config-router)# passive-interface vlan 40
DSW-A2(config-router)# network 10.0.0.50 0.0.0.0 area 0
DSW-A2(config-router)# network 10.0.0.66 0.0.0.0 area 0
DSW-A2(config-router)# network 10.0.0.3 0.0.0.0 area 0
DSW-A2(config-router)# network 10.1.0.3 0.0.0.0 area 0
DSW-A2(config-router)# network 10.2.0.3 0.0.0.0 area 0
DSW-A2(config-router)# network 10.6.0.3 0.0.0.0 area 0
DSW-A2(config-router)# network 10.0.0.80 0.0.0.0 area 0
DSW-A2(config-router)# exit

DSW-A2(config)# interface range g1/1/1-2
DSW-A2(config-if-range)# ip ospf network point-to-point
DSW-A2(config-if-range)# exit
DSW-A2(config)# do write
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞ —Å–æ—Å–µ–¥—Å—Ç–≤–∞ DSW-A2:**
```cisco
DSW-A2# show ip ospf neighbor
```

–î–æ–ª–∂–Ω—ã –≤–∏–¥–µ—Ç—å:
- 10.0.0.79 (DSW-A1) —á–µ—Ä–µ–∑ VLAN 99
- 10.0.0.77 (CSW1) —á–µ—Ä–µ–∑ G1/1/1
- 10.0.0.78 (CSW2) —á–µ—Ä–µ–∑ G1/1/2

---

### –®–ê–ì 1 (–ø—Ä–æ–¥–æ–ª–∂–µ–Ω–∏–µ): DSW-B1 Configuration

```cisco
DSW-B1(config)# router ospf 1
DSW-B1(config-router)# router-id 10.0.0.81
DSW-B1(config-router)# passive-interface loopback 0
DSW-B1(config-router)# passive-interface vlan 10
DSW-B1(config-router)# passive-interface vlan 20
DSW-B1(config-router)# passive-interface vlan 30
DSW-B1(config-router)# network 10.0.0.54 0.0.0.0 area 0
DSW-B1(config-router)# network 10.0.0.70 0.0.0.0 area 0
DSW-B1(config-router)# network 10.0.0.18 0.0.0.0 area 0
DSW-B1(config-router)# network 10.3.0.2 0.0.0.0 area 0
DSW-B1(config-router)# network 10.4.0.2 0.0.0.0 area 0
DSW-B1(config-router)# network 10.5.0.2 0.0.0.0 area 0
DSW-B1(config-router)# network 10.0.0.81 0.0.0.0 area 0
DSW-B1(config-router)# exit

DSW-B1(config)# interface range g1/1/1-2
DSW-B1(config-if-range)# ip ospf network point-to-point
DSW-B1(config-if-range)# exit
DSW-B1(config)# do write
```

---

### –®–ê–ì 1 (–ø—Ä–æ–¥–æ–ª–∂–µ–Ω–∏–µ): DSW-B2 Configuration

```cisco
DSW-B2(config)# router ospf 1
DSW-B2(config-router)# router-id 10.0.0.82
DSW-B2(config-router)# passive-interface loopback 0
DSW-B2(config-router)# passive-interface vlan 10
DSW-B2(config-router)# passive-interface vlan 20
DSW-B2(config-router)# passive-interface vlan 30
DSW-B2(config-router)# network 10.0.0.58 0.0.0.0 area 0
DSW-B2(config-router)# network 10.0.0.74 0.0.0.0 area 0
DSW-B2(config-router)# network 10.0.0.19 0.0.0.0 area 0
DSW-B2(config-router)# network 10.3.0.3 0.0.0.0 area 0
DSW-B2(config-router)# network 10.4.0.3 0.0.0.0 area 0
DSW-B2(config-router)# network 10.5.0.3 0.0.0.0 area 0
DSW-B2(config-router)# network 10.0.0.82 0.0.0.0 area 0
DSW-B2(config-router)# exit

DSW-B2(config)# interface range g1/1/1-2
DSW-B2(config-if-range)# ip ospf network point-to-point
DSW-B2(config-if-range)# exit
DSW-B2(config)# do write
```

**–ü—Ä–æ–≤–µ—Ä–∫–∞ –º–∞—Ä—à—Ä—É—Ç–æ–≤:**
```cisco
DSW-B2# show ip route ospf
```

–î–æ–ª–∂–Ω—ã –≤–∏–¥–µ—Ç—å –º–∞—Ä—à—Ä—É—Ç—ã —á–µ—Ä–µ–∑ CSW1 –∏ CSW2 –∫–æ –≤—Å–µ–º —Å–µ—Ç—è–º.

---

## üìù –ß–ê–°–¢–¨ 4: Static Default Routes

### –®–ê–ì 2: –ù–∞—Å—Ç—Ä–æ–π–∫–∞ Static Default Routes –Ω–∞ R1

**–ö–æ–Ω—Ü–µ–ø—Ü–∏—è:**
- –î–≤–∞ –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è –∫ Internet: ISP A –∏ ISP B
- –û—Å–Ω–æ–≤–Ω–æ–π –º–∞—Ä—à—Ä—É—Ç —á–µ—Ä–µ–∑ ISP A (AD = 1)
- Backup –º–∞—Ä—à—Ä—É—Ç —á–µ—Ä–µ–∑ ISP B (AD = 2) - Floating Static Route

**R1 Internet Interfaces:**
- G0/0/0: 203.0.113.2/30 ‚Üí ISP A (203.0.113.1)
- G0/1/0: 203.0.113.6/30 ‚Üí ISP B (203.0.113.5)

```cisco
R1(config)# ip route 0.0.0.0 0.0.0.0 203.0.113.1
R1(config)# ip route 0.0.0.0 0.0.0.0 203.0.113.5 2
R1(config)# exit
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- –ü–µ—Ä–≤—ã–π –º–∞—Ä—à—Ä—É—Ç: AD = 1 (default) - –æ—Å–Ω–æ–≤–Ω–æ–π
- –í—Ç–æ—Ä–æ–π –º–∞—Ä—à—Ä—É—Ç: AD = 2 - backup (floating)

**–ü—Ä–æ–≤–µ—Ä–∫–∞:**
```cisco
R1# show ip route static
```

–î–æ–ª–∂–µ–Ω –±—ã—Ç—å –∞–∫—Ç–∏–≤–µ–Ω —Ç–æ–ª—å–∫–æ –º–∞—Ä—à—Ä—É—Ç —á–µ—Ä–µ–∑ 203.0.113.1:
```
S*    0.0.0.0/0 [1/0] via 203.0.113.1
```

---

## üìù –ß–ê–°–¢–¨ 5: OSPF Default Route Advertisement

### –®–ê–ì 2b: –ù–∞—Å—Ç—Ä–æ–π–∫–∞ R1 –∫–∞–∫ ASBR

**ASBR (Autonomous System Boundary Router):**
- –†–æ—É—Ç–µ—Ä –Ω–∞ –≥—Ä–∞–Ω–∏—Ü–µ OSPF –¥–æ–º–µ–Ω–∞
- –ê–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç –≤–Ω–µ—à–Ω–∏–µ –º–∞—Ä—à—Ä—É—Ç—ã –≤ OSPF
- R1 –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç default route

```cisco
R1(config)# router ospf 1
R1(config-router)# default-information originate
R1(config-router)# exit
R1(config)# do write
```

**–û–±—ä—è—Å–Ω–µ–Ω–∏–µ:**
- `default-information originate` - –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç default route –≤ OSPF
- –í—Å–µ —Ä–æ—É—Ç–µ—Ä—ã –≤ OSPF –ø–æ–ª—É—á–∞—Ç –º–∞—Ä—à—Ä—É—Ç 0.0.0.0/0

**–ü—Ä–æ–≤–µ—Ä–∫–∞ –Ω–∞ DSW-B2:**
```cisco
DSW-B2# show ip route
```

–î–æ–ª–∂–Ω—ã –≤–∏–¥–µ—Ç—å:
```
O*E2  0.0.0.0/0 [110/1] via [next-hop CSW1/CSW2]
```

- `O*E2` - OSPF External Type 2 (default route)

**–¢–µ—Å—Ç —Å–≤—è–∑–Ω–æ—Å—Ç–∏:**
```cisco
DSW-B2# ping 203.0.113.2
```

–î–æ–ª–∂–µ–Ω —Ä–∞–±–æ—Ç–∞—Ç—å ping –¥–æ Internet IP R1.

---

## ‚úÖ –ü—Ä–æ–≤–µ—Ä–∫–∞ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏

### 1. OSPF Neighbors

```cisco
R1# show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
10.0.0.77         0   FULL/  -        00:00:3x    10.0.0.34       GigabitEthernet0/0
10.0.0.78         0   FULL/  -        00:00:3x    10.0.0.38       GigabitEthernet0/1
```

**–û–∂–∏–¥–∞–µ–º—ã–µ —Å–æ—Å–µ–¥–∏:**
- R1: CSW1, CSW2
- CSW1: R1, CSW2, DSW-A1, DSW-A2, DSW-B1, DSW-B2
- CSW2: R1, CSW1, DSW-A1, DSW-A2, DSW-B1, DSW-B2
- DSW-A1: CSW1, CSW2, DSW-A2 (—á–µ—Ä–µ–∑ VLAN 99)
- DSW-A2: CSW1, CSW2, DSW-A1 (—á–µ—Ä–µ–∑ VLAN 99)
- DSW-B1: CSW1, CSW2, DSW-B2 (—á–µ—Ä–µ–∑ VLAN 99)
- DSW-B2: CSW1, CSW2, DSW-B1 (—á–µ—Ä–µ–∑ VLAN 99)

---

### 2. OSPF Interfaces

```cisco
R1# show ip ospf interface brief

Interface    PID   Area            IP Address/Mask    Cost  State Nbrs F/C
Lo0          1     0               10.0.0.76/32       1     LOOP  0/0
Gi0/0        1     0               10.0.0.33/30       1     P2P   1/1
Gi0/1        1     0               10.0.0.37/30       1     P2P   1/1
```

---

### 3. OSPF Routes

```cisco
DSW-A1# show ip route ospf
```

**–û–∂–∏–¥–∞–µ–º—ã–µ OSPF –º–∞—Ä—à—Ä—É—Ç—ã:**
```
O     10.0.0.36/30 [110/2] via 10.0.0.1, Vlan99
O     10.0.0.40/30 [110/2] via 10.0.0.1, Vlan99
O     10.0.0.76/32 [110/2] via 10.0.0.45, GigabitEthernet1/1/1
O     10.0.0.77/32 [110/1] via 10.0.0.45, GigabitEthernet1/1/1
O     10.0.0.78/32 [110/1] via 10.0.0.61, GigabitEthernet1/1/2
O*E2  0.0.0.0/0 [110/1] via 10.0.0.45, GigabitEthernet1/1/1
                [110/1] via 10.0.0.61, GigabitEthernet1/1/2
```

---

### 4. Default Route

```cisco
R1# show ip route static

S*    0.0.0.0/0 [1/0] via 203.0.113.1
```

```cisco
DSW-B2# show ip route | include 0.0.0.0

O*E2  0.0.0.0/0 [110/1] via 10.0.0.73, GigabitEthernet1/1/2
                [110/1] via 10.0.0.57, GigabitEthernet1/1/1
```

---

### 5. Ping Tests

```cisco
! Ping –º–µ–∂–¥—É –æ—Ñ–∏—Å–∞–º–∏
DSW-A1# ping 10.0.0.18

! Ping loopback
DSW-A1# ping 10.0.0.82

! Ping Internet IP
DSW-A1# ping 203.0.113.2

! Ping ISP (–ø–æ—Å–ª–µ NAT –≤ —Å–ª–µ–¥—É—é—â–µ–π —á–∞—Å—Ç–∏)
DSW-A1# ping 203.0.113.1
```

---

## üìä OSPF Router ID Summary

| Device | Router ID | Loopback IP |
|--------|-----------|-------------|
| R1 | 10.0.0.76 | 10.0.0.76/32 |
| CSW1 | 10.0.0.77 | 10.0.0.77/32 |
| CSW2 | 10.0.0.78 | 10.0.0.78/32 |
| DSW-A1 | 10.0.0.79 | 10.0.0.79/32 |
| DSW-A2 | 10.0.0.80 | 10.0.0.80/32 |
| DSW-B1 | 10.0.0.81 | 10.0.0.81/32 |
| DSW-B2 | 10.0.0.82 | 10.0.0.82/32 |

---

## üìä OSPF Network Type Summary

| Link | Network Type | DR/BDR |
|------|--------------|--------|
| R1 ‚Üî CSW1/CSW2 | Point-to-Point | No |
| CSW1 ‚Üî DSW switches | Point-to-Point | No |
| CSW2 ‚Üî DSW switches | Point-to-Point | No |
| CSW1 ‚Üî CSW2 (Po1) | Broadcast | Yes (–Ω–æ –Ω–µ –∫—Ä–∏—Ç–∏—á–Ω–æ) |
| DSW ‚Üî DSW (VLAN 99) | Broadcast | Yes |

---

## üìä Passive Interfaces Summary

| Device | Passive Interfaces |
|--------|--------------------|
| R1 | Lo0 |
| CSW1 | Lo0 |
| CSW2 | Lo0 |
| DSW-A1 | Lo0, VLAN 10, 20, 40 |
| DSW-A2 | Lo0, VLAN 10, 20, 40 |
| DSW-B1 | Lo0, VLAN 10, 20, 30 |
| DSW-B2 | Lo0, VLAN 10, 20, 30 |

**VLAN 99 NOT passive** - –Ω—É–∂–Ω–æ –¥–ª—è —Å–æ—Å–µ–¥—Å—Ç–≤–∞ –º–µ–∂–¥—É DSW

---

## üí° –ü—Ä–∞–∫—Ç–∏—á–µ—Å–∫–∏–µ —Å–æ–≤–µ—Ç—ã

### OSPF Best Practices:
1. ‚úÖ –í—Å–µ–≥–¥–∞ –∑–∞–¥–∞–≤–∞–π—Ç–µ Router ID –≤—Ä—É—á–Ω—É—é
2. ‚úÖ –ò—Å–ø–æ–ª—å–∑—É–π—Ç–µ Point-to-Point –Ω–∞ p2p –ª–∏–Ω–∫–∞—Ö
3. ‚úÖ –î–µ–ª–∞–π—Ç–µ passive interface –Ω–∞ LAN –±–µ–∑ OSPF —Å–æ—Å–µ–¥–µ–π
4. ‚úÖ –ò—Å–ø–æ–ª—å–∑—É–π—Ç–µ loopback –¥–ª—è Router ID
5. ‚úÖ –ü—Ä–æ–≤–µ—Ä—è–π—Ç–µ —Å–æ—Å–µ–¥—Å—Ç–≤–∞ –ø–µ—Ä–µ–¥ –ø—Ä–æ–¥–æ–ª–∂–µ–Ω–∏–µ–º

### –¢–∏–ø–∏—á–Ω—ã–µ –æ—à–∏–±–∫–∏:
‚ùå –ó–∞–±—ã—Ç—å `router-id` - —Ä–æ—É—Ç–µ—Ä –≤—ã–±–µ—Ä–µ—Ç —Å–∞–º (–º–æ–∂–µ—Ç –∏–∑–º–µ–Ω–∏—Ç—å—Å—è)  
‚ùå –ù–µ–ø—Ä–∞–≤–∏–ª—å–Ω—ã–π wildcard mask –≤ network statement  
‚ùå –ó–∞–±—ã—Ç—å `passive-interface` –Ω–∞ loopback  
‚ùå –ó–∞–±—ã—Ç—å `ip ospf network point-to-point`  
‚ùå Passive interface –Ω–∞ VLAN 99 (–Ω—É–∂–Ω–æ —Å–æ—Å–µ–¥—Å—Ç–≤–æ!)  
‚ùå –ó–∞–±—ã—Ç—å `default-information originate`  

---

## üß™ –¢–µ—Å—Ç–∏—Ä–æ–≤–∞–Ω–∏–µ OSPF

### –¢–µ—Å—Ç 1: –ü—Ä–æ–≤–µ—Ä–∫–∞ —Å–æ—Å–µ–¥—Å—Ç–≤

```cisco
! –ù–∞ –∫–∞–∂–¥–æ–º —É—Å—Ç—Ä–æ–π—Å—Ç–≤–µ
show ip ospf neighbor
```

–ü–æ–¥—Å—á–∏—Ç–∞–π—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Å–æ—Å–µ–¥–µ–π:
- R1: 2 (CSW1, CSW2)
- CSW1: 6 (R1, CSW2, 4√óDSW)
- DSW-A1: 3 (CSW1, CSW2, DSW-A2)

---

### –¢–µ—Å—Ç 2: Failover Test

```cisco
! –ù–∞ R1 –æ—Ç–∫–ª—é—á–∏—Ç—å G0/0
R1(config)# interface g0/0
R1(config-if)# shutdown

! –ü—Ä–æ–≤–µ—Ä–∏—Ç—å –º–∞—Ä—à—Ä—É—Ç
R1# show ip route static
! –î–æ–ª–∂–µ–Ω –∞–∫—Ç–∏–≤–∏—Ä–æ–≤–∞—Ç—å—Å—è floating route —á–µ—Ä–µ–∑ ISP B

! –í–∫–ª—é—á–∏—Ç—å –æ–±—Ä–∞—Ç–Ω–æ
R1(config-if)# no shutdown
```

---

### –¢–µ—Å—Ç 3: OSPF Route Propagation

```cisco
! –ù–∞ DSW-B2 –ø—Ä–æ–≤–µ—Ä–∏—Ç—å –º–∞—Ä—à—Ä—É—Ç—ã Office A
DSW-B2# show ip route | include 10.1.0.0
DSW-B2# show ip route | include 10.2.0.0

! –î–æ–ª–∂–Ω—ã –±—ã—Ç—å OSPF –º–∞—Ä—à—Ä—É—Ç—ã
```

---

## üéì –ö–ª—é—á–µ–≤—ã–µ –∫–æ–º–∞–Ω–¥—ã –ß–∞—Å—Ç–∏ 5

```cisco
# OSPF Configuration
router ospf [process-id]
 router-id [ip-address]
 network [ip] [wildcard-mask] area [area-id]
 passive-interface [type] [number]
 default-information originate

# OSPF Interface Configuration
interface [type] [number]
 ip ospf [process-id] area [area-id]
 ip ospf network point-to-point

# Static Routes
ip route [network] [mask] [next-hop] [ad]

# Verification
show ip ospf
show ip ospf neighbor
show ip ospf interface [type] [number]
show ip ospf interface brief
show ip route ospf
show ip route static
show ip protocols
```

---

## üìñ Wildcard Mask Calculation

### Subnet Mask ‚Üí Wildcard Mask

**–ü—Ä–∞–≤–∏–ª–æ:** –ò–Ω–≤–µ—Ä—Ç–∏—Ä–æ–≤–∞—Ç—å –±–∏—Ç—ã subnet mask

**–ü—Ä–∏–º–µ—Ä—ã:**

| Subnet Mask | Wildcard Mask | –ò—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∏–µ |
|-------------|---------------|---------------|
| 255.255.255.255 | 0.0.0.0 | –¢–æ—á–Ω—ã–π IP –∞–¥—Ä–µ—Å (/32) |
| 255.255.255.252 | 0.0.0.3 | /30 —Å–µ—Ç—å (p2p links) |
| 255.255.255.0 | 0.0.255.255 | /24 —Å–µ—Ç—å |
| 255.255.0.0 | 0.0.255.255 | /16 —Å–µ—Ç—å |
| 255.0.0.0 | 0.255.255.255 | /8 —Å–µ—Ç—å |

**–§–æ—Ä–º—É–ª–∞:**
```
Wildcard Mask = 255.255.255.255 - Subnet Mask

–ü—Ä–∏–º–µ—Ä –¥–ª—è /30 (255.255.255.252):
255.255.255.255
-255.255.255.252
----------------
  0.  0.  0.  3
```

---

## üîç Troubleshooting OSPF

### –ü—Ä–æ–±–ª–µ–º–∞ 1: –ù–µ—Ç —Å–æ—Å–µ–¥—Å—Ç–≤–∞

**–°–∏–º–ø—Ç–æ–º—ã:**
```cisco
R1# show ip ospf neighbor
% OSPF: No neighbors found
```

**–ü—Ä–∏—á–∏–Ω—ã –∏ —Ä–µ—à–µ–Ω–∏—è:**

1. **OSPF –Ω–µ –≤–∫–ª—é—á–µ–Ω –Ω–∞ –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–µ**
```cisco
! –ü—Ä–æ–≤–µ—Ä–∫–∞
show ip ospf interface brief

! –†–µ—à–µ–Ω–∏–µ
interface g0/0
 ip ospf 1 area 0
```

2. **–†–∞–∑–Ω—ã–µ Area**
```cisco
! –ü—Ä–æ–≤–µ—Ä–∫–∞
show ip ospf interface g0/0

! –†–µ—à–µ–Ω–∏–µ - –¥–æ–ª–∂–Ω—ã –±—ã—Ç—å –≤ –æ–¥–Ω–æ–π area
router ospf 1
 network 10.0.0.33 0.0.0.0 area 0
```

3. **Passive interface**
```cisco
! –ü—Ä–æ–≤–µ—Ä–∫–∞
show ip ospf interface g0/0

! –†–µ—à–µ–Ω–∏–µ
router ospf 1
 no passive-interface g0/0
```

---

### –ü—Ä–æ–±–ª–µ–º–∞ 2: –ù–µ—Ç –º–∞—Ä—à—Ä—É—Ç–æ–≤ –≤ —Ç–∞–±–ª–∏—Ü–µ

**–°–∏–º–ø—Ç–æ–º—ã:**
```cisco
DSW-A1# show ip route ospf
! –ü—É—Å—Ç–æ –∏–ª–∏ –º–∞–ª–æ –º–∞—Ä—à—Ä—É—Ç–æ–≤
```

**–†–µ—à–µ–Ω–∏–µ:**
```cisco
! –ü—Ä–æ–≤–µ—Ä–∏—Ç—å —Å–æ—Å–µ–¥—Å—Ç–≤–∞
show ip ospf neighbor

! –ü—Ä–æ–≤–µ—Ä–∏—Ç—å OSPF database
show ip ospf database

! –ü—Ä–æ–≤–µ—Ä–∏—Ç—å —á—Ç–æ OSPF –≤–∫–ª—é—á–µ–Ω –Ω–∞ –Ω—É–∂–Ω—ã—Ö –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å–∞—Ö
show ip ospf interface brief
```

---

### –ü—Ä–æ–±–ª–µ–º–∞ 3: Default route –Ω–µ —Ä–∞—Å–ø—Ä–æ—Å—Ç—Ä–∞–Ω—è–µ—Ç—Å—è

**–°–∏–º–ø—Ç–æ–º—ã:**
```cisco
DSW-B2# show ip route | include 0.0.0.0
! –ù–µ—Ç –º–∞—Ä—à—Ä—É—Ç–∞ 0.0.0.0/0
```

**–†–µ—à–µ–Ω–∏–µ –Ω–∞ R1:**
```cisco
! –ü—Ä–æ–≤–µ—Ä–∫–∞
show ip route static
show running-config | section router ospf

! –†–µ—à–µ–Ω–∏–µ
router ospf 1
 default-information originate
```

---

### –ü—Ä–æ–±–ª–µ–º–∞ 4: Floating route –Ω–µ –∞–∫—Ç–∏–≤–∏—Ä—É–µ—Ç—Å—è

**–°–∏–º–ø—Ç–æ–º—ã:**
Primary –º–∞—Ä—à—Ä—É—Ç down, –Ω–æ backup –Ω–µ –∞–∫—Ç–∏–≤–∏—Ä—É–µ—Ç—Å—è

**–†–µ—à–µ–Ω–∏–µ:**
```cisco
! –ü—Ä–æ–≤–µ—Ä–∫–∞
show ip route static

! –£–±–µ–¥–∏—Ç—å—Å—è —á—Ç–æ AD floating route –≤—ã—à–µ
ip route 0.0.0.0 0.0.0.0 203.0.113.5 2

! –û–±–Ω–æ–≤–∏—Ç—å OSPF –∞–Ω–æ–Ω—Å
router ospf 1
 no default-information originate
 default-information originate
```

---

## üéØ –ß–µ–∫-–ª–∏—Å—Ç –∑–∞–≤–µ—Ä—à–µ–Ω–∏—è –ß–∞—Å—Ç–∏ 5

- [ ] OSPF –≤–∫–ª—é—á–µ–Ω –Ω–∞ R1 (G0/0, G0/1, Lo0)
- [ ] OSPF –≤–∫–ª—é—á–µ–Ω –Ω–∞ CSW1 (–≤—Å–µ L3 –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å—ã)
- [ ] OSPF –≤–∫–ª—é—á–µ–Ω –Ω–∞ CSW2 (–≤—Å–µ L3 –∏–Ω—Ç–µ—Ä—Ñ–µ–π—Å—ã)
- [ ] OSPF –≤–∫–ª—é—á–µ–Ω –Ω–∞ DSW-A1 (uplinks + SVIs)
- [ ] OSPF –≤–∫–ª—é—á–µ–Ω –Ω–∞ DSW-A2 (uplinks + SVIs)
- [ ] OSPF –≤–∫–ª—é—á–µ–Ω –Ω–∞ DSW-B1 (uplinks + SVIs)
- [ ] OSPF –≤–∫–ª—é—á–µ–Ω –Ω–∞ DSW-B2 (uplinks + SVIs)
- [ ] Router ID –Ω–∞—Å—Ç—Ä–æ–µ–Ω –≤—Ä—É—á–Ω—É—é –Ω–∞ –≤—Å–µ—Ö —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞—Ö
- [ ] Passive interfaces –Ω–∞—Å—Ç—Ä–æ–µ–Ω—ã (loopbacks + SVIs)
- [ ] Point-to-Point network type –Ω–∞ p2p –ª–∏–Ω–∫–∞—Ö
- [ ] OSPF —Å–æ—Å–µ–¥—Å—Ç–≤–∞ —É—Å—Ç–∞–Ω–æ–≤–ª–µ–Ω—ã (–ø—Ä–æ–≤–µ—Ä–∏—Ç—å –Ω–∞ –∫–∞–∂–¥–æ–º)
- [ ] Static default routes –Ω–∞—Å—Ç—Ä–æ–µ–Ω—ã –Ω–∞ R1
- [ ] Floating static route —Ä–∞–±–æ—Ç–∞–µ—Ç (AD=2)
- [ ] R1 –∞–Ω–æ–Ω—Å–∏—Ä—É–µ—Ç default route (default-information originate)
- [ ] Default route –≤–∏–¥–µ–Ω –Ω–∞ –≤—Å–µ—Ö —É—Å—Ç—Ä–æ–π—Å—Ç–≤–∞—Ö (O*E2)
- [ ] Ping —Ä–∞–±–æ—Ç–∞–µ—Ç –º–µ–∂–¥—É –æ—Ñ–∏—Å–∞–º–∏
- [ ] Ping —Ä–∞–±–æ—Ç–∞–µ—Ç –¥–æ R1 Internet IP
- [ ] –í—Å–µ –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏–∏ —Å–æ—Ö—Ä–∞–Ω–µ–Ω—ã

---

## üìö OSPF –¢–µ–æ—Ä–∏—è - –î–æ–ø–æ–ª–Ω–∏—Ç–µ–ª—å–Ω–æ

### OSPF Packet Types

| Type | Name | Description |
|------|------|-------------|
| 1 | Hello | –û–±–Ω–∞—Ä—É–∂–µ–Ω–∏–µ —Å–æ—Å–µ–¥–µ–π |
| 2 | DBD | Database Description |
| 3 | LSR | Link State Request |
| 4 | LSU | Link State Update |
| 5 | LSAck | Link State Acknowledgment |

### OSPF Neighbor States

| State | Description |
|-------|-------------|
| Down | –ù–∞—á–∞–ª—å–Ω–æ–µ —Å–æ—Å—Ç–æ—è–Ω–∏–µ |
| Init | –ü–æ–ª—É—á–µ–Ω Hello |
| 2-Way | –î–≤—É—Å—Ç–æ—Ä–æ–Ω–Ω–µ–µ –æ–±—â–µ–Ω–∏–µ |
| ExStart | –ù–∞—á–∞–ª–æ –æ–±–º–µ–Ω–∞ DBD |
| Exchange | –û–±–º–µ–Ω DBD |
| Loading | –ó–∞–ø—Ä–æ—Å LSA |
| Full | –ü–æ–ª–Ω–æ–µ —Å–æ—Å–µ–¥—Å—Ç–≤–æ |

### OSPF LSA Types

| Type | Name | Description |
|------|------|-------------|
| 1 | Router LSA | –ò–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è –æ —Ä–æ—É—Ç–µ—Ä–µ |
| 2 | Network LSA | –ò–Ω—Ñ–æ—Ä–º–∞—Ü–∏—è –æ—Ç DR |
| 3 | Summary LSA | Inter-area routes (ABR) |
| 4 | ASBR Summary | –ü—É—Ç—å –¥–æ ASBR |
| 5 | External LSA | External routes (ASBR) |

---

## üìä OSPF Cost Calculation

**Formula:**
```
Cost = Reference Bandwidth / Interface Bandwidth

Default Reference Bandwidth = 100 Mbps (100,000 Kbps)
```

**Examples:**

| Interface | Bandwidth | Cost Calculation | Cost |
|-----------|-----------|------------------|------|
| FastEthernet | 100 Mbps | 100,000 / 100,000 | 1 |
| GigabitEthernet | 1 Gbps | 100,000 / 1,000,000 | 1 |
| Serial (T1) | 1.544 Mbps | 100,000 / 1,544 | 64 |
| Serial (64k) | 64 Kbps | 100,000 / 64 | 1562 |

üí° **–í–∞–∂–Ω–æ:** –í —Å–æ–≤—Ä–µ–º–µ–Ω–Ω—ã—Ö —Å–µ—Ç—è—Ö GigE –∏ FastE –∏–º–µ—é—Ç –æ–¥–∏–Ω–∞–∫–æ–≤—ã–π cost (1). –î–ª—è –ø—Ä–∞–≤–∏–ª—å–Ω–æ–≥–æ —Ä–∞—Å—á—ë—Ç–∞ –∏—Å–ø–æ–ª—å–∑—É–π—Ç–µ `auto-cost reference-bandwidth 10000` –¥–ª—è 10G —Å–µ—Ç–µ–π.

---

## üéì OSPF Administrative Distance

| Route Source | AD |
|--------------|-----|
| Directly Connected | 0 |
| Static Route | 1 |
| EIGRP Summary | 5 |
| External BGP | 20 |
| Internal EIGRP | 90 |
| OSPF | 110 |
| IS-IS | 115 |
| RIP | 120 |
| External EIGRP | 170 |
| Internal BGP | 200 |

**–í –Ω–∞—à–µ–π –ª–∞–±–µ:**
- Static route: AD = 1 (primary)
- Static floating route: AD = 2 (backup)
- OSPF: AD = 110

---

## üí° Advanced Tips

### –û–ø—Ç–∏–º–∏–∑–∞—Ü–∏—è OSPF Timers

```cisco
! –ü–æ —É–º–æ–ª—á–∞–Ω–∏—é: Hello 10s, Dead 40s
interface g0/0
 ip ospf hello-interval 5
 ip ospf dead-interval 20
```

### OSPF Authentication (–Ω–µ —Ç—Ä–µ–±—É–µ—Ç—Å—è –≤ –ª–∞–±–µ)

```cisco
interface g0/0
 ip ospf authentication message-digest
 ip ospf message-digest-key 1 md5 MyPassword
```

### OSPF Summarization (–Ω–µ —Ç—Ä–µ–±—É–µ—Ç—Å—è –≤ –ª–∞–±–µ)

```cisco
router ospf 1
 area 1 range 10.1.0.0 255.255.0.0
```

---

## üìù Quick Reference Commands

```cisco
# –ë–∞–∑–æ–≤–∞—è –∫–æ–Ω—Ñ–∏–≥—É—Ä–∞—Ü–∏—è
router ospf 1
 router-id 10.0.0.76
 network 10.0.0.33 0.0.0.0 area 0
 passive-interface lo0
 default-information originate

# –ò–Ω—Ç–µ—Ä—Ñ–µ–π—Å
interface g0/0
 ip ospf 1 area 0
 ip ospf network point-to-point

# –ü—Ä–æ–≤–µ—Ä–∫–∞ - –ö—Ä–∞—Ç–∫–∞—è
show ip ospf neighbor
show ip ospf interface brief
show ip route ospf

# –ü—Ä–æ–≤–µ—Ä–∫–∞ - –î–µ—Ç–∞–ª—å–Ω–∞—è
show ip ospf
show ip ospf interface g0/0
show ip ospf database
show ip protocols

# Troubleshooting
debug ip ospf hello
debug ip ospf adj
clear ip ospf process
```

---

## üöÄ –ì–æ—Ç–æ–≤—ã –∫ –ß–∞—Å—Ç–∏ 6?

–í —Å–ª–µ–¥—É—é—â–µ–π —á–∞—Å—Ç–∏ –º—ã –Ω–∞—Å—Ç—Ä–æ–∏–º –≤—Å–µ Network Services:

### Network Services (–ß–∞—Å—Ç—å 6):
1. üåê **DHCP** - –∞–≤—Ç–æ–º–∞—Ç–∏—á–µ—Å–∫–∞—è –≤—ã–¥–∞—á–∞ IP –∞–¥—Ä–µ—Å–æ–≤
2. üì° **DHCP Relay** - –ø–µ—Ä–µ—Å—ã–ª–∫–∞ DHCP —á–µ—Ä–µ–∑ —Ä–æ—É—Ç–µ—Ä—ã
3. üîç **DNS** - —Ä–∞–∑—Ä–µ—à–µ–Ω–∏–µ –∏–º—ë–Ω
4. ‚è∞ **NTP** - —Å–∏–Ω—Ö—Ä–æ–Ω–∏–∑–∞—Ü–∏—è –≤—Ä–µ–º–µ–Ω–∏
5. üìä **SNMP** - –º–æ–Ω–∏—Ç–æ—Ä–∏–Ω–≥ —Å–µ—Ç–∏
6. üìù **Syslog** - —Ü–µ–Ω—Ç—Ä–∞–ª–∏–∑–æ–≤–∞–Ω–Ω–æ–µ –ª–æ–≥–∏—Ä–æ–≤–∞–Ω–∏–µ
7. üìÅ **FTP** - –ø–µ—Ä–µ–¥–∞—á–∞ —Ñ–∞–π–ª–æ–≤
8. üîê **SSH** - –±–µ–∑–æ–ø–∞—Å–Ω—ã–π —É–¥–∞–ª—ë–Ω–Ω—ã–π –¥–æ—Å—Ç—É–ø
9. üîÑ **NAT** - —Ç—Ä–∞–Ω—Å–ª—è—Ü–∏—è –∞–¥—Ä–µ—Å–æ–≤ (Static + PAT)

–≠—Ç–æ –±—É–¥–µ—Ç —Å–∞–º–∞—è –Ω–∞—Å—ã—â–µ–Ω–Ω–∞—è —á–∞—Å—Ç—å –∫—É—Ä—Å–∞!

**–î–æ –≤—Å—Ç—Ä–µ—á–∏ –≤ –ß–∞—Å—Ç–∏ 6! üéì**